[
  {
    "post_id": 6968127104269,
    "expected_comment_count": 124,
    "actual_comment_count": 124,
    "status": "ok",
    "comments": [
      {
        "id": 6968704131213,
        "body": "<p><strong>Balancing Allay duplication:</strong></p>\n<p>Currently it feels a bit too cheap. I get the reasoning that they should be renewable for technical players, but many technical players (including myself) have the same concern that it is too easy. It also lowers the value of mansions and outposts yet again.</p>\n<p>Here are some simple fixes to make it more balanced:</p>\n<ul>\n<li>Change shards to amethyst clusters, they seem more magical (and musical) than shards. Renewable but not too easy to obtain.</li>\n</ul>\n<ul>\n<li>Only 1 or 2 specific discs should be allowed to be used. This is because discs like Cat and 13 are too easy to find, every dungeon chest has them.</li>\n</ul>\n<ul>\n<li>If that's not possible, at least make it so that discs 11, 13 and 5 can't be used, as they are not \"music\".</li>\n</ul>\n<ul>\n<li>Give it a longer cooldown, say once every 10 mins, or once every Minecraft day.</li>\n</ul>\n<ul>\n<li>Just make it <strong>breeding</strong> instead of duplicating. Even though they're magical fairies, it makes sense: they're free, you're playing music that they dance to, so there's no reason why they can't breed two by two like other mobs. This makes them consistent with every other overworld mob. This also lowers the exponential increase you get by duplicating single allays (2^n versus 1.5^n)</li>\n</ul>",
        "author_id": 423323742151,
        "vote_sum": 15,
        "vote_count": 15,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6968704131213",
        "created_at": "2022-06-16T07:32:09Z",
        "updated_at": "2022-07-05T14:09:40Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6968704131213.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6968871496845,
        "body": "<p>Can you fix cave biomes based on this planetminecraft datapack called better cave gen</p>",
        "author_id": 423348157832,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6968871496845",
        "created_at": "2022-06-16T07:45:32Z",
        "updated_at": "2022-06-17T06:42:55Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6968871496845.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6968856681613,
        "body": "<p>And drop mandatory censorship</p>",
        "author_id": 423348157832,
        "vote_sum": 198,
        "vote_count": 198,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6968856681613",
        "created_at": "2022-06-16T07:46:01Z",
        "updated_at": "2023-12-25T16:58:53Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6968856681613.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6969185656717,
        "body": "<p>The Player Chat Reporting feature, as presented, is a terrible idea on almost every level. It creates a ton of work for Mojang, it's ridiculously ripe for abuse by bad actors, and it violates the very concept of a private server as a space controlled by the person running it.<br><br>Chat messages being reported directly to Mojang, especially without any input from the server owner, is ripe for abuse in a dozen ways. What constitutes acceptable conduct is often highly context-sensitive, and you are going to have no context whatsoever for these reports because private servers are neither owned, operated, nor controlled by Mojang. What is and is not acceptable behavior on a private server can and should be determined solely by the owner of that server, as they're the only ones who possess the necessary context to make that judgement.</p>",
        "author_id": 5393486304525,
        "vote_sum": 177,
        "vote_count": 177,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6969185656717",
        "created_at": "2022-06-16T08:09:28Z",
        "updated_at": "2022-07-11T02:35:22Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6969185656717.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6969366777741,
        "body": "<p>Looking at what people say on Reddit, Discord and other, the community's reaction to this is negative.</p>\n<p>Mojang does not have the right/need/ability to moderate decentralised comminities' chat. Each server has their own community and rules, that's the selling point of Java Edition - and trying to plug a centralized set of rules and moderation into it will ruin everything. There also are obvious concerns on how the system will work. quoting:</p>\n<blockquote>\n<ul>\n<li>\n<p>Will the option to be able to report someone be a mandatory thing in any multiplayer servers that use authentication (as they should)?</p>\n</li>\n<li>\n<p>Will the server owner get to have a word on report outcomes first?</p>\n</li>\n<li>\n<p>What exactly is the moderation policy on reported chat messages?</p>\n</li>\n<li>\n<p>How can you be sure chat messages are not reported completely out of context, willfully leaving out important information that would put seemingly harassing messages into a completely different light?</p>\n</li>\n</ul>\n</blockquote>\n<p>Moderation should belong to server admins, as it always did, not Mojang/Microsoft. Not even saying that the punishment for a few bad words on a private server may be a game-wide permanent ban without appeal - don't you think that's a bit too much? <em>There have been cases of this.</em></p>\n<p>There is a lot more feedback at the Reddit post for the snapshot - more concerns, more dislike, even suggestions of alternative systems. This is where most of the feedback on the topic is.</p>",
        "author_id": 416829780772,
        "vote_sum": 170,
        "vote_count": 170,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6969366777741",
        "created_at": "2022-06-16T08:20:07Z",
        "updated_at": "2022-07-11T02:35:17Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6969366777741.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6969422978957,
        "body": "<p>Please consider make the report function only available in realm, or at least make 3-rd party servers opt-in. Community management should be dedicated to each server, at least each 3-rd party server should be able to opt-out of centralized chat monitoring. No player want to be banned for profanity in a mature server.</p>\n<p>I would suggest to make chat report toggleable each server, and to meet some regulations, verified underage accounts could be unable to join servers that toggled chat reports off.</p>",
        "author_id": 5911041767053,
        "vote_sum": 125,
        "vote_count": 125,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6969422978957",
        "created_at": "2022-06-16T08:27:31Z",
        "updated_at": "2022-07-11T02:35:35Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6969422978957.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6970987257741,
        "body": "<p>I'll be honest here, reporting players on privately run servers is probably the worst idea you've had since forcing everyone to make a Microsoft account. I really hope this was added just to see the community reactions and won't make it into the final build.</p>",
        "author_id": 6970717015821,
        "vote_sum": 243,
        "vote_count": 243,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6970987257741",
        "created_at": "2022-06-16T10:17:10Z",
        "updated_at": "2022-07-11T02:35:41Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6970987257741.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6971089933581,
        "body": "<p>On the topic of chat reporting:</p>\n<p>TL;DR: I'm OK with moderation but not with Big Brothers.</p>\n<p>To start with, we definitely need more context as to how this feature actually works. What exactly happens if someone gets reported? How are the reports reviewed? Are there punishments? If so, what can they be? Are there measures to prevent abuse of this mechanism?</p>\n<p>Next, the idea that Mojang employees moderate every 1.19.1 server out there is scary. If a server is hosted by Mojang (like Realms), sure. But 3rd party servers? That would be very wrong. Please say it ain't so. Please let such communities have their own moderation. (Also, if there should be many reports you guys would need a lot of work-hours to go through all of them.)</p>\n<p>By the way, similar things can be said about the text filtering feature. It currently only works on Realms and can be toggled - that is good.</p>\n<p>Please do not think I dislike moderation and players' safety - I don't. I am just a little afraid.</p>",
        "author_id": 6970791076237,
        "vote_sum": 175,
        "vote_count": 175,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6971089933581",
        "created_at": "2022-06-16T10:28:01Z",
        "updated_at": "2022-07-11T03:11:03Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6971089933581.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6971792724877,
        "body": "<p>Player-ran Minecraft servers were originally indented to be their own separate thing, completely ran and managed by their respective owner. Now you guys want to moderate chats for servers that you don't even own. We will see a sharp increase in cracked servers, if this is gonna be on the final build.</p>",
        "author_id": 6971782143885,
        "vote_sum": 89,
        "vote_count": 89,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6971792724877",
        "created_at": "2022-06-16T11:14:56Z",
        "updated_at": "2022-07-09T08:55:41Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6971792724877.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6972470935821,
        "body": "<p>looking at what you have said so far about chat reporting is scary. Minecraft has thrived for years due to it trusting its players, giving them creative control over every aspect of your game, and giving them the responsibilities that come with them. moderation of 3rd party servers, be them minigame based, anarchy or just between a few friends is honestly disgusting.&nbsp;</p>\n<p>Mojang, you have done so much good for the game. please don't ruin the multiplayer experience now. let communities moderate themselves, as they always have.</p>",
        "author_id": 368890708531,
        "vote_sum": 63,
        "vote_count": 63,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6972470935821",
        "created_at": "2022-06-16T11:53:11Z",
        "updated_at": "2022-07-11T03:11:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6972470935821.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6972833526925,
        "body": "<p>I'm strongly against this reporting system. Bans should be up to the owners of servers, realms, etc. Mojang, microsoft, or bots should not moderate players. You can't expect players to report honestly; if toxic players don't like you &amp; mass-report you, what happens then? A ban from ALL multiplayer games forever? False bans &amp; censorship are a BIG issue in Bedrock already.</p>\n<p>I like the Allay duplication, though. They tend to die, get lost, and there's just not enough of them especially in multiplayer. Mansions &amp; outposts are still useful to travel to; to get the Allay in the first place. But players shouldn't be forced to keep exploring more &amp; more mansions to get Allays.</p>\n<p>There's a problem with exploration in Minecraft, especially in Bedrock. Exploration can create gigabytes of file size bloat, and mobile/console have disk space limitations. Large file sizes can also lag &amp; crash the game.</p>\n<p>I really want exploration to be infinite in Minecraft worlds, keeping players hooked on adventure. If we add temporary, roguelike, randomly generated dimensions that resets after clearing it, exploration can truly be infinite. The 2020 april fools update had strong potential, and it will fit well in ender dimension updates! You can even add bosses at the end of these dimensions. I wouldn't mind searching for extremely rare stuff, if I can explore infinitely!</p>\n<p>Amethyst should have even more uses in the future. Magic staff, spells? End dimension should introduce new system, like Nether potions.</p>",
        "author_id": 410058947311,
        "vote_sum": 58,
        "vote_count": 58,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6972833526925",
        "created_at": "2022-06-16T12:11:03Z",
        "updated_at": "2022-08-05T13:24:22Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6972833526925.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6972909271821,
        "body": "<p>This is scary. Chat moderation on private servers just seems absolutely insane and will not work, if it works the way I think it does. The idea isn’t bad but the execution is what concerns me. Reporting chats to Mojang for review whereby a suitable punishment (whatever that may be) is or is not issued by Mojang is crazy. I get that there are requirements for better safety for players as Minecraft is a game played by a wide age range of people but this is not the way. If this was a tool that allowed reports to go to the owners and moderators of private servers then sure, absolutely, but going directly to Microso… Mojang is crazy. And my concern is just that, Microsoft. First we had account migration (which was a very bad move in my opinion) and now we are having this new feature introduced and it just stinks of Microsoft forcing changes onto the game. This is more concerning when you consider the number of reports that this terrible system is going to generate as there is no way there will be manual review of every single report and instead the bulk of the work will be pushed onto an auto moderation system with a manual review of disputes or something. The only way to make this work is to have the ability to disable this system on a per server basis, and have an option in the server to allow server owners to review the reports instead of pushing them directly to Mojang. Otherwise just scrap the whole thing. \n<br />I suspect I’m talking into a void here however…</p>",
        "author_id": 6972627099789,
        "vote_sum": 47,
        "vote_count": 47,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6972909271821",
        "created_at": "2022-06-16T12:14:50Z",
        "updated_at": "2022-07-11T03:11:12Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6972909271821.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6973848021517,
        "body": "<p>I'm not a fan of the player chat reporting, I do believe that its important to feel safe online but at the same time freedom to run privately owned servers is important.</p>\n<p>A good compromise would be the same system used on realms where the profanity filter can be toggled, except instead of the basic profanity filter its the whole reporting system (or parts of it), this allows server owners to make their public servers a safe space while letting privately owned servers be ran however we wish.</p>\n<p>To make sure people are aware of a server's reporting system it would be good to warn players when joining a server that has this functionality turned off, and maybe even blocking child accounts from joining unmoderated servers.</p>",
        "author_id": 6973578208269,
        "vote_sum": 33,
        "vote_count": 33,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6973848021517",
        "created_at": "2022-06-16T12:59:37Z",
        "updated_at": "2022-07-09T08:55:50Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6973848021517.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6974067736717,
        "body": "<p>\"We want to hear your feedback on this\"</p>\n<p>If this is true, we should not see anything related to chat reporting in next week's snapshot. This chat happens on third party servers, not Mojang/Microsoft's servers, and you are not responsible for what happens there, nor should you make that the case.</p>\n<p>The chat reporting feature is a great idea otherwise, and I would personally love to see something like it that sends reports to server owners instead of Mojang, with the option to escalate the report to Mojang available to the owners if the content of the reported message needs it. Reporting a single message to Mojang removes a lot of context that is only available to server owners, and that should change the outcome of the report.</p>\n<p>If it's too late and the feature will not be removed, a good middle ground is having the option to opt in/opt out of chat reporting in the server properties file, or the option for chat bans to take effect or not for individual servers. While the main demographic of this game might be younger (Which is arguably somewhat less of a problem with Java compared to Bedrock), private servers serve their own separate demographics, and while a single chat message might be offensive, the context that it was sent in might permit these messages. Additionally, it can result in a lot of abuse and mass-reporting, and we can't be sure how that is going to be handled.</p>\n<p>We really hope that our reception of this update has been clear, and that you can take our feedback seriously.</p>",
        "author_id": 6973621946381,
        "vote_sum": 41,
        "vote_count": 41,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6974067736717",
        "created_at": "2022-06-16T13:06:55Z",
        "updated_at": "2022-07-09T08:55:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6974067736717.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6974998936845,
        "body": "<p>Firstly, the method of getting new allays at the moment is a bit too easy and defeats the purpose of finding a mansion. Maybe if the allays are only renewable in the mansions it would give more reasons to visit the mansions, or if allays can't be found in pillager outpost. Either way, it should force a player to seek out a mansion to start.</p>\n<p>As for the chat reporting system, I'm quite a bit worried about what that will mean for multiplayer servers. I think it might be a good idea if there was an opt out system where the chat could be censored for a player when entering general multiplayer server (chat and signs could be censored for the players that have this censor on, but not for players who have it off), but I think in terms of what is said and behaviors on multiplayer servers, that should be up to the server moderators.</p>\n<p>&nbsp;</p>",
        "author_id": 407999197812,
        "vote_sum": 14,
        "vote_count": 14,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6974998936845",
        "created_at": "2022-06-16T13:44:25Z",
        "updated_at": "2022-06-29T05:21:03Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6974998936845.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6975109792781,
        "body": "<p>the report player feature should only exist on mojang hosted servers, put it on any third party server and it will be abused to death, you know how many alts some people have? how about anarchy servers, this is literally limiting free speech and free will of ruling on third party server and there's no way this will get through the player base without major restrictions and reworks, lately mojang's failure to handle new features has only made the players more united to speak out and this time it will be no different</p>",
        "author_id": 6974889544845,
        "vote_sum": 31,
        "vote_count": 31,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6975109792781",
        "created_at": "2022-06-16T13:48:58Z",
        "updated_at": "2022-07-09T08:56:04Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6975109792781.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6975291230349,
        "body": "<p>My opinion on chat reporting.<br><br>This is a good feature for servers having to use external report plugins, but there should be a option in server.properties to disable it for the current server, as the external report plugins have options for chat and cheating reports. Alongside that what will be the punishment if someone gets reported? The current external plugin solution is far better than what you may do as it is per server and not in all servers.<br><br>This is the reason why most of the people hate this.<br>This should be a configurable option.</p>",
        "author_id": 6975150592013,
        "vote_sum": 105,
        "vote_count": 105,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6975291230349",
        "created_at": "2022-06-16T13:54:24Z",
        "updated_at": "2022-07-09T08:56:18Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6975291230349.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6975556279693,
        "body": "<p>I had seen the new chat reporting feature and I am worried about players trying to abuse it.&nbsp; I know there are a lot of terrible things online and it&nbsp;<em>could</em> be a good thing- but if a ton of reports are filed, I am worried that fully investigating each one may not be possible.&nbsp;</p>\n<p>According to the Community Standards, \"If there’s a chat function available in a game or on a website, be mindful of other people’s experience. This includes avoiding excessive posting or spamming. Also, all-caps is often read as YELLING! And yelling at someone is usually not very nice.\"</p>\n<p>Could typing a message in all caps be reported for the \"bullying or harassment\" category?&nbsp; What if someone accidentally hit the caps lock key?&nbsp; If there's a large number of reports would moderators actually be able to investigate all of them? If it's done automatically, how would you prevent it from being abused?</p>\n<p>Overall, I feel like this system&nbsp;<em>could</em> be a good thing to help protect people online, but it comes down to the implementation of it.</p>",
        "author_id": 6974637703693,
        "vote_sum": 23,
        "vote_count": 23,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6975556279693",
        "created_at": "2022-06-16T14:03:00Z",
        "updated_at": "2022-07-09T08:56:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6975556279693.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976126356493,
        "body": "<p>Chat reporting is a good idea, but only if the messages are going to server admins/mods, not Microsoft.</p>",
        "author_id": 6975519673357,
        "vote_sum": 121,
        "vote_count": 121,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976126356493",
        "created_at": "2022-06-16T14:22:25Z",
        "updated_at": "2022-07-09T08:56:23Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976126356493.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976203100301,
        "body": "<p>The chat reporting system seems solid in principle - but both myself and many other server owners are concerned about the vague implementation and rules.</p>\n<p>How will this work? Will it be a simple config option that we can turn off, or will it be forced on? If it is a config option, will it prevent certain players from joining? What kind of punishments will be implemented?</p>\n<p>For me and many others, the beauty of Java edition is the freedom for server owners to be able to create their own communities, moderate it as they see fit, and run things how they want. I think this is a big step backwards and brings Java edition closer to the locked-down, microsoft-ran bedrock edition.</p>\n<p>If this was purely a move to prevent child exploitation, I would be behind it and I think everyone else would be too - but policing <em>profanity</em> and&nbsp;<em>talking about drugs and alcohol </em>is one of the dumbest moves in the game in recent times.</p>\n<p>I really hope that this is just to gauge the community response, and that this feature seriously isn't going to be implemented.</p>",
        "author_id": 384972471712,
        "vote_sum": 20,
        "vote_count": 20,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976203100301",
        "created_at": "2022-06-16T14:25:02Z",
        "updated_at": "2022-06-28T09:32:20Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976203100301.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976295819149,
        "body": "<p>NO, no chat moderation from microsoft, server owner SHOULD BE the only one choosing how to run their server.</p>",
        "author_id": 6976278762893,
        "vote_sum": 142,
        "vote_count": 142,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976295819149",
        "created_at": "2022-06-16T14:27:46Z",
        "updated_at": "2022-07-09T08:56:33Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976295819149.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976498404365,
        "body": "<p>I understand the censorship being a feature designed for public servers. But it has no place on private servers. A potential fix is to just make it an opt-in inside the server.properties. That way, servers who want this have it as an option while others who don't want it aren't forced to make workarounds to stop it being an issue.</p>",
        "author_id": 6976345589389,
        "vote_sum": 102,
        "vote_count": 102,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976498404365",
        "created_at": "2022-06-16T14:34:46Z",
        "updated_at": "2022-07-09T08:56:35Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976498404365.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976602172429,
        "body": "<p>Do not like this chat reporting thing at all.</p>\n<p>It's going to ruin 3rd-party multiplayer servers (basically non-Realms). It may not seem terrible now, but what does this mean for the future? How many more Microsoft-moderated features are going to be added to \"ensure the safety of players on Minecraft.\"</p>\n<p>Some servers aren't even public and are just for friends, all it takes is one bad/angry/joking friend to report you, and POOF, you're gone (I assume the punishment would be a mute or ban of some kind across all of Minecraft).</p>",
        "author_id": 387873772332,
        "vote_sum": 22,
        "vote_count": 22,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976602172429",
        "created_at": "2022-06-16T14:39:00Z",
        "updated_at": "2022-07-09T08:57:08Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976602172429.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976817781645,
        "body": "<p>Oh no, this feature is a perfect recipe for a disaster. I can see so, so many unfair bans because of this feature, from major servers like Hypixel to small privately run SMPs for group of my friends for example, not to mention servers like 2b2t (which granted, are toxic, but forced moderation like this will obliterate the entire playerbase, no matter if the offending players are actually edgy or offensive).</p>\n<p>If y'all want to add this into the game then fine, go ahead, but you must make it optional and indenpendent from Mojang/Microsoft moderation, like have the reports sent to the Server Owner and other designated players so they can deal with the reports as they see fit, or else as I said before, tiny private servers and huge public ones alike are gonna experience what I would call \"literally 1984\".</p>",
        "author_id": 6976618547853,
        "vote_sum": 23,
        "vote_count": 23,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976817781645",
        "created_at": "2022-06-16T14:47:00Z",
        "updated_at": "2022-07-09T08:57:10Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976817781645.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6976938807949,
        "body": "<p>Chat reporting is a horrible idea.</p>\n<p>Moderation on community servers should be left up to the server owners. I don't want Microsoft's awful AI moderating my private server. I have my own rules, as do all community servers.</p>\n<p>I'm sincerely hoping this is just going to be for Realms. That information seems to have been intentionally left out.</p>",
        "author_id": 6976865681165,
        "vote_sum": 22,
        "vote_count": 22,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6976938807949",
        "created_at": "2022-06-16T14:51:25Z",
        "updated_at": "2022-07-09T08:57:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6976938807949.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6977267553421,
        "body": "<p>The chat report/logging feature is an awful idea, and I would like to express my dissent/concerns about it as a server owner of 5-6 years. My server is completely above board, has a friendly community and support staff, and respects the EULA. Me and my staff team work every day to foster a safe community where these things aren't an issue. Slurs and sexual harassment receive an instant perm-ban, and other harassment/flaming is taken very seriously and often met with a temporary ban or mute if we cannot resolve the issue in an amicable manner. </p>\n\n<p>What this planned chat moderation feature essentially means is that MOJANG will be moderating my server for me, and deciding what is okay inside MY community. As previously stated we do a VERY good job of preventing hatred and inappropriate chat topics, so this feels like something of a slap in the face to the freedom that Minecraft usually allows. If this is going to exist it NEEDS to be a toggle which you can opt out of. I can also see this being a go to option for people to gang up on a player and try to get them banned without any proper review or context of what really happened. Your content moderation teams aren't on my server, so what makes you think they have the ability to accurately moderate ANY reported messages without context. Not to mention the headache this is going to cause for me with ban appeals that I can't do anything about and have no knowledge of. </p>\n\n<p>This is a stupid decision. Please don't do it. We're not Roblox.</p>",
        "author_id": 6976744074637,
        "vote_sum": 23,
        "vote_count": 23,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6977267553421",
        "created_at": "2022-06-16T15:00:23Z",
        "updated_at": "2022-07-09T08:57:18Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6977267553421.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6977303915533,
        "body": "<p>I've read that this new snapshot implements a bug known as \"Chat report\". I hope the developers fix this horrible glitch!</p>\n<p>Seriously though, no. This topic shouldn't even be a discussion argument. I, and only MYSELF decide what is ammissible on my server, as long as it is legal. Otherwise, the police must intervent. NOT Mojang nor Microsoft.</p>",
        "author_id": 404014262632,
        "vote_sum": 17,
        "vote_count": 17,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6977303915533",
        "created_at": "2022-06-16T15:01:22Z",
        "updated_at": "2022-07-09T08:57:23Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6977303915533.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6977492846349,
        "body": "<p>I am totally against this as a server owner. I am the person to moderate my server NOT MOJANG. I decide what is tolerated on my server and what is not.</p>\n<p>Do whatever you want on realms on whatever, do not touch private servers.</p>\n<p><br>This should be opt-in, not opt-out by the way if mojang ever thinks its a good idea (its not).</p>",
        "author_id": 6977461160845,
        "vote_sum": 19,
        "vote_count": 19,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6977492846349",
        "created_at": "2022-06-16T15:06:55Z",
        "updated_at": "2022-07-09T08:57:26Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6977492846349.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6977737021069,
        "body": "<p>While I get the need for moderation, the Player Chat Reporting feature is not a good idea, and I (and probably a lot of others) would like it removed or overhauled.<br>Only the server owners/admins should have control over what is allowed and what isn't on their private server.</p>\n<p>It doesn't really matter what punishment a reported player gets, this system doesn't make sense and would be hugely abused.</p>\n<ul>\n<li>Players could get mass-reported</li>\n<li>Well-known people could get targeted</li>\n<li>Chat messages could be faked with server-side plugins and mods</li>\n</ul>\n<p>And don't tell me the reports will be each reviewed, with so many players playing Minecraft, in no way reports won't be just glanced over or automated. And false positives can always happen.</p>\n<p>Now, I don't know what would the reported player get, I can only hope nothing major, if they get punished at all, or just put on a \"baddie-list\". I hope it's not something like banning people from playing the game altogether, that would be terrible for the playerbase.</p>\n<p>While I could see this system work well on Realms, this really shouldn't be implemented on servers ran by individuals. They should be the only ones at charge of moderation, not Mojang or Microsoft.</p>\n<p>However, the reporting UI could stay and instead of the reports going to Mojang or Microsoft, they could go to server owners and admins somehow. I think it would be a great change to the system.</p>",
        "author_id": 6970536763533,
        "vote_sum": 61,
        "vote_count": 61,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6977737021069",
        "created_at": "2022-06-16T15:13:29Z",
        "updated_at": "2022-07-09T08:57:29Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6977737021069.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6978108927373,
        "body": "<p>Server reporting is completely 100% not okay and is a breach of server privacy, I should be allowed to admin <strong>my</strong> server how I want to, and the idea of being reported for \"profanity\" on <strong>my</strong> server, for <strong>my community</strong>, and having Microsoft/Mojang look at it and \"take action\" is <strong>completely unacceptable</strong>, I have moderators that look at reports made using systems in my server to take appropriate action in regards to my community and my rules, and having that action taken away from me, I might as well not even be running the server. This should be an option you can disable in server config for scenarios such as these.</p>",
        "author_id": 6977792556301,
        "vote_sum": 59,
        "vote_count": 59,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6978108927373",
        "created_at": "2022-06-16T15:24:22Z",
        "updated_at": "2022-07-09T08:57:31Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6978108927373.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6978394891405,
        "body": "<p>There is no information on the reporting system at all, where are the reports going to? To mojang themselves? How are you going to handle all those reports and when are they taken seriously? What if a server allows insults? Are they going to the admins if the server itself?</p>\n\n<p>As it stands right now i think the report system should not be added as it is now. Give us some more info how its going to work before bringing something so controversial!</p>",
        "author_id": 6978285745037,
        "vote_sum": 37,
        "vote_count": 37,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6978394891405",
        "created_at": "2022-06-16T15:33:23Z",
        "updated_at": "2022-06-24T07:42:52Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6978394891405.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6978524480141,
        "body": "<p>Please remove the chat moderation, this is a horrible idea.</p>\n<p>This feature may becoming another fracturing point for the community with servers running older versions or offline mode to avoid censorship.</p>\n<p>I know that if this is implemented I will seriously consider disabling authentication on my server.</p>",
        "author_id": 6978344066573,
        "vote_sum": 9,
        "vote_count": 9,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6978524480141",
        "created_at": "2022-06-16T15:37:24Z",
        "updated_at": "2022-06-23T16:02:02Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6978524480141.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6979403170957,
        "body": "<p>Please don't add this chat reporting feature. It will ruin privately owned servers. Let these small servers be, if people are okay with swearing let it be up to the server owners to decide that, not have a function where some random person can just report you and your friends for swearing or joking around. At least have an option to disable it, but it would be really be nice for it not to be implemented at all.&nbsp;<br><br>Please, Mojang, you're better than this. I know it's the people at Microsoft and the higher-ups at Mojang which made this decision, and they cowardly hide behind the developers so the devs get targeted for \"ruining the game,\" while the higher-ups can skate around their responsibility.</p>\n<p>Shame on you, Microsoft and higher-ups of Mojang for making some of the worst decisions, then having the developers bear the responsibility of your actions.&nbsp;</p>",
        "author_id": 390881297811,
        "vote_sum": 8,
        "vote_count": 8,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6979403170957",
        "created_at": "2022-06-16T16:03:34Z",
        "updated_at": "2022-06-23T16:02:07Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6979403170957.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6979542981773,
        "body": "<p>This top down moderating of private servers is one parity feature from the Bedrock edition that shouldn't make it's way over here and is objectively worse than phantoms.</p>",
        "author_id": 6979506676621,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6979542981773",
        "created_at": "2022-06-16T16:06:49Z",
        "updated_at": "2022-06-22T17:48:43Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6979542981773.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6979559040525,
        "body": "<p>This has its obvious problems. Allowing Microsoft to 'moderate' servers that WE OWN is nonsense. It takes freedom away from the server moderators to properly moderate, and freedom from the server owners to appoint moderators. Microsoft, stay out of OUR server's business, and let us handle any 'dangerous' players.</p>\n<p>If this feature were to be implemented without a proper way to completely disable it, servers would most likely choose to stay on versions prior to this feature. We all know how that goes.</p>\n<p>So clearly, I am not a fan of this feature with the limited information provided, and Microsoft should abolish this idea.</p>",
        "author_id": 6979213502349,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6979559040525",
        "created_at": "2022-06-16T16:07:07Z",
        "updated_at": "2022-06-22T17:49:16Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6979559040525.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6980197644429,
        "body": "<p>I have mixed feelings on chat reporting. Personally I don't think it's a bad idea, so long as the guidelines, rules, whatever you want to call them, aren't terribly strict. Obviously things like racial slurs and whatnot should be punished for but I've seen things in the guidelines which imo shouldn't be punished for outside of Microsoft-owned servers (i.e. saying curse words on Hypixel shouldn't be grounds for Microsoft punishment), basically I think it'd work so long as it has the perfect balance. But I've never seen any company or individual achieve that balance before when trying to get it for things like this sooooooo yeah</p>",
        "author_id": 364933689891,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6980197644429",
        "created_at": "2022-06-16T16:27:07Z",
        "updated_at": "2022-06-18T12:24:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6980197644429.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6980467978125,
        "body": "<p>Heres my take on this player report system.</p>\n\n<p>Mojang, in all honesty, I understand you want to protect children on servers, but having a chat report on multiplayer is an EXTREMELY bad idea, given that most java servers are third party, and have their own rules and regulations set in place. Having this Big Brother-esque system in place is flat out censorship and if it's going to be run by bots, people are going to heavily abuse this system to get innocent players permanently banned, and with Microsofts system on bedrock where if you are banned, there is ZERO chance to appeal. This would be absolutely unacceptable and will anger a huge portion of the community. You say you want to correct your past mistakes? Because this sounds like a \n<br />Step forward and two steps back scenario on your part. Please reconsider this and know that this will cause you a lot of community backlash if you choose to ignore us and continue with this controversial feature. </p>",
        "author_id": 416012519911,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6980467978125",
        "created_at": "2022-06-16T16:37:04Z",
        "updated_at": "2022-06-23T16:02:33Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6980467978125.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6981175933837,
        "body": "<p>Please make in-game reporting an optional, opt-in/opt-out feature for servers. I realize the feature likely isn't going to be cut completely, and this is a compromise that I think would work for basically everyone. This is a feature that I and most other people would be almost happy, or at least neutral about, if it was simply made optional.&nbsp;<br><br>I understand that Mojang likely has good intentions with this feature, but the fact of the matter is that players don't always have good intentions. There will be mass reports, there will be false bans, creating a hassle for both the players and moderation team responsible for handling these cases - if such a team will even exist.</p>",
        "author_id": 384391320991,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6981175933837",
        "created_at": "2022-06-16T16:59:16Z",
        "updated_at": "2022-06-19T00:44:01Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6981175933837.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6982260720141,
        "body": "<p>Why don't you just add a social contract, auto ban with certain words, automatically calling the police to arrest you irl, taking you to the mojang studios stockade.</p>",
        "author_id": 399053159211,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6982260720141",
        "created_at": "2022-06-16T17:33:24Z",
        "updated_at": "2022-06-17T21:12:14Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6982260720141.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6982681506701,
        "body": "<p>In all honestly I'm not fully against the idea of global chat reporting for some things, but there are some categories which feel way too overreaching for any server that isn't meant to target children (profanity, drugs and alcohol), which do and <em>should </em>exist when you can host and run a server by yourself.</p>\n<p>In addition to this, some categories could likely involve things said out of context (In particular, things said about blowing up or otherwise killing someone <em>ingame </em>could be fairly easily misconstrued as actual threats)</p>\n<p>\"Harassment or Bullying\" also feels a bit vague and potentially more of a thing targeting younger players.</p>\n<p>All things considered, I believe it would be better for reports to be given to server owners rather than a team at microsoft/mojang, or at least have them given to server owners <em>first </em>to decide if they warrant being passed to microsoft/mojang.</p>",
        "author_id": 420854945631,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6982681506701",
        "created_at": "2022-06-16T17:48:00Z",
        "updated_at": "2022-06-17T23:24:42Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6982681506701.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6982768276493,
        "body": "<p>Please do not add this feature, we don't want minecraft java to end up like the bedrock edition where it's heavily censored. </p>",
        "author_id": 393966364732,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6982768276493",
        "created_at": "2022-06-16T17:51:40Z",
        "updated_at": "2022-06-19T00:44:09Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6982768276493.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6982835196429,
        "body": "<p>As long as the moderation that is linked to this chat reporting system is opt-in through server properties or even a launch option, as long as it's not required to have a publicly available server, it's a perfectly okay system for servers that want to open themselves up to a vulnerable playerbase. But servers that don't aim for that audience should NOT be forced to comply, that will ruin the entire creative freedom that multiplayer is supposed to encourage.</p>",
        "author_id": 382593052911,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6982835196429",
        "created_at": "2022-06-16T17:53:21Z",
        "updated_at": "2022-06-19T00:44:31Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6982835196429.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6983823155085,
        "body": "<p>Servers should be managed by their respective owners, not Mojang or Microsoft.&nbsp;</p>",
        "author_id": 409980017472,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6983823155085",
        "created_at": "2022-06-16T18:24:51Z",
        "updated_at": "2022-06-19T21:55:00Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6983823155085.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6983890742413,
        "body": "<p>I think that you guys are underestimating the nuance required for chat filtering in Minecraft.</p>\n<p>What if someone said something acceptable in a 18+ environment in a 18+ Minecraft server but got reported for it, it would be hard to see that the server was 18+ and that there where no children around.</p>\n<p>When it comes to it many existing server have already rules about what is and isn’t allowed which may not be compatible with Mojang’s rules and cause “false” bans.</p>\n<p>There may be a need for servers to specify some text for rules for instance to be send along with the report on servers which would still leave LAN world with the problem, another solution would be to send the reports to the administrator of the server.</p>\n<p>At the end of the day, I think that implemented this not good enough, the situation might produce more false bans then solve issues. On the other hand, I also want to say that this game probably has to deal with some really bad people which everyone definitely wants to get rid off.</p>\n<p>In the end, I think that we might just need some more communication to make intensions and rules more clear.</p>",
        "author_id": 389969008231,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6983890742413",
        "created_at": "2022-06-16T18:27:52Z",
        "updated_at": "2022-06-18T13:11:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6983890742413.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6984820902797,
        "body": "<p>If this is implemented in the final release, it has to be optional. Server hosts should have the ability to turn it on/off on command. If you're worried about the safety of users, maybe just put a warning on servers that don't have this when you join, such as the one that was implemented not long ago when you click ok the \"multiplayer\" button. </p>\n\n<p>I do need clarification on what would happen if someone's message were to be reported. How do you check if the reported messages are harmful in some way? What will the punishment be? Once again, if there are going to be punishments, i think the server hosts should be able to configure what happens to someone if their reported message has been proven harmful. And of course the punishment should only apply to the server the reported message was sent in. </p>\n\n<p>Essentially, this should work like third party report / punishment plugins work now, but it would just be easily accessible in the vanilla game.</p>",
        "author_id": 386351045571,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6984820902797",
        "created_at": "2022-06-16T18:59:58Z",
        "updated_at": "2022-06-19T00:44:54Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6984820902797.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6984999026573,
        "body": "<p>The new chat reporting features are honestly pretty terrible. If they actually are going to be implemented onto 3rd party servers, I guess we can say goodbye to anarchy servers and non-family friendly servers, because there's now heavy censorship on servers!<br><br>And another thing, servers should definitely moderate their own stuff. We don't need Microsoft to step in and introduce a bunch of stupid rules on lets say, an anarchy server. If anything, there should be an <strong>automatically disabled</strong> thing in server.properties to have these chat features. Even so, I don't want Microsoft to enforce chat features.</p>",
        "author_id": 6984529963021,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6984999026573",
        "created_at": "2022-06-16T19:04:31Z",
        "updated_at": "2022-06-19T21:56:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6984999026573.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6985495552141,
        "body": "<p>I am deeply concerned about the potential outcome of this player report feature. Not only do servers moderate for vastly different demographics, but this system is guaranteed to be less effective and prone to more errors. Additionally, there is no description of how punishments will work and I fear that entire accounts will get banned from multiplayer just for some bad interactions on one server. If someone gets banned from a server, they still have the opportunity to turn over a new leaf on another, but I'm worried that's not how this centralized system will work.</p>",
        "author_id": 6985006343693,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6985495552141",
        "created_at": "2022-06-16T19:21:28Z",
        "updated_at": "2022-06-18T13:11:27Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6985495552141.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6985539238541,
        "body": "<p>Minecraft has functioned for well over a decade without chat moderation. Now is not the time to add it. If a Java server wants chat moderation, then they will put their own systems in place. As stated by others, with realms this is a different story. However, independently hosted servers should absolutely <strong>not</strong>&nbsp;be subject to a reporting system they may not want.&nbsp;</p>",
        "author_id": 6985249445645,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6985539238541",
        "created_at": "2022-06-16T19:21:40Z",
        "updated_at": "2022-06-18T13:11:29Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6985539238541.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6986849007501,
        "body": "<p>Microsoft made chat moderation is a horrible idea and we all remember how badly it went on bedrock.</p>",
        "author_id": 6986806057613,
        "vote_sum": 57,
        "vote_count": 57,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6986849007501",
        "created_at": "2022-06-16T20:09:47Z",
        "updated_at": "2022-06-24T07:43:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6986849007501.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6986957836813,
        "body": "<p>Absolutley not. Dedicated servers run by players are their responsibilty only. You can moderate your Realms, because you run those, but you do not get to decide what is OK for people to say in private SMPs. I am an administrator of a server for my school, and we have rules that do not allow racism, homophobia, transphobia, etc. AND methods to enforce those rules in the Minecraft server and on the Discord server.\n<br />I am perfectly capable of moderating the chat, builds, etc. of my players, because I know most of these people personally and I am able to determine what is a joke and what is an actual insult much better than any Microsoft employee will be able to. Do not continue with this feature, it will not improve the game, the game's image, or the experience of its players, and it will simply be a pain to bypass/disable for server operators such as myself.</p>",
        "author_id": 387874181092,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6986957836813",
        "created_at": "2022-06-16T20:13:28Z",
        "updated_at": "2022-06-17T23:25:27Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6986957836813.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6987283768973,
        "body": "<p>wouldn't a poorly made sudo plugin be able to frame people and get them banned?</p>",
        "author_id": 6986902366221,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6987283768973",
        "created_at": "2022-06-16T20:22:35Z",
        "updated_at": "2022-06-17T23:25:28Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6987283768973.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6987867617165,
        "body": "<p>&nbsp;While I appreciate the goal you guys have with the chat reporting feature, I urge you to allow server owners to disable it in the server.properties file. Servers, at least in Java Edition, have always been hosted and completely controlled by the community, which means there are a lot of unique servers with their own individual demographics and rules.</p>\n<p>&nbsp;Many servers, especially anarchy ones such as 2b2t, have adult-dominated player populations, which means that profanity and the discussion of topics such as alcohol can be commonplace. If this system were to be forced, I imagine many players would abuse it on these types of servers in an act of toxicity, even if the server owners allow that kind of discussion.</p>\n<p>&nbsp;I think I have gotten my point across, and I don't really need to further explain why not making the chat report feature optional is a bad idea. Just to be constructive, I am going to try and propose some solutions here:</p>\n<ul>\n<li>Allow the chat report feature to be turned on/off in server.properties.</li>\n<li>Implement a 'tags' feature in the server list. Server admins can choose from a list of preset tags that contain what sensitive content a server may contain (profanity, disturbing imagery, etc).</li>\n<li>Allow Mojang to change the tags if needed (not too sure how this would work out, though).</li>\n</ul>\n<p>&nbsp;I am by no means a game dev, so I apologize if I'm displaying any naivety here. Overall, I just think chat reporting needs to be made optional for server admins as Minecraft's audience is just too wide.</p>",
        "author_id": 6986989335949,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6987867617165",
        "created_at": "2022-06-16T20:47:50Z",
        "updated_at": "2022-06-17T23:27:00Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6987867617165.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6988586013709,
        "body": "<p>The Player Chat Reporting feature is a terrible idea, even more considering how extreme can and it'll be. The server owner/moderators should be the one doing that job however they see fit, not Microsoft.</p>",
        "author_id": 6988523831821,
        "vote_sum": 45,
        "vote_count": 45,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6988586013709",
        "created_at": "2022-06-16T21:13:05Z",
        "updated_at": "2022-06-24T07:43:16Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6988586013709.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6988834400397,
        "body": "<p>Why are you trying to make minecraft into literally 1984. Please stop trying to censor us. We are humans and freedom of speech is a human right!!!!!!</p>",
        "author_id": 6988824879117,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6988834400397",
        "created_at": "2022-06-16T21:22:43Z",
        "updated_at": "2022-06-17T22:50:46Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6988834400397.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6988960693133,
        "body": "<p>Dude come ON! Bad news after bad news with this company man! What are you guys doing and why do you think it is the right thing!!!! Oh my LORD! PLEASE do not do this with the mandatory chat restriction!</p>",
        "author_id": 422638532552,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6988960693133",
        "created_at": "2022-06-16T21:25:51Z",
        "updated_at": "2022-06-18T22:14:33Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6988960693133.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6989036691981,
        "body": "<p>Please drop the Player Chat report system. It is the responsibility of the Server Owners and Server Moderators to enact punishment on misbehaving players. This feature strips those people of the power to control their playerbases. Additionally, it would end up allowing people to report things out of context just to get someone banned for a false reason. Don't let this feature be implemented, it is oppressive of the Minecraft Playerbase of a whole. Servers are a THIRD-PARTY function and should remain such!</p>",
        "author_id": 6988919029005,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6989036691981",
        "created_at": "2022-06-16T21:29:00Z",
        "updated_at": "2022-06-17T23:27:13Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6989036691981.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6989028582669,
        "body": "<p>Are y'all actually trying to control every player from swearing? Not only you are taking away the power to ban someone from server owners, but with a simple taken out of context conversation/text someone could get banned for life from entering any multiplayer server? Are you serious right now? Don't you see the issue?&nbsp;</p>",
        "author_id": 6988978038029,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6989028582669",
        "created_at": "2022-06-16T21:29:13Z",
        "updated_at": "2022-06-19T21:57:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6989028582669.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6989354403853,
        "body": "<p>The reporting thing is unneccesarry because it should be at the owners discretion what can or cant be said on a server. Also when someone gets banned, will they just be banned from the specific server or will they be unable to play MP in general?</p>\n<p>&nbsp;</p>",
        "author_id": 6989306262413,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6989354403853",
        "created_at": "2022-06-16T21:44:57Z",
        "updated_at": "2022-06-17T22:09:31Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6989354403853.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6989460823053,
        "body": "<p>There is no way to do this chat moderation right, no matter how much you improve it, it will be abused. The entire system is unacceptable and needs to be removed</p>",
        "author_id": 6989443672461,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6989460823053",
        "created_at": "2022-06-16T21:48:21Z",
        "updated_at": "2022-06-17T23:27:25Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6989460823053.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6989741293325,
        "body": "<p>nobody asked for this, how about concrete slabs and stairs instead?</p>",
        "author_id": 6989566394637,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6989741293325",
        "created_at": "2022-06-16T22:00:01Z",
        "updated_at": "2022-06-19T21:56:43Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6989741293325.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6989943180429,
        "body": "<p>Drop the chat moderation</p>",
        "author_id": 394171974371,
        "vote_sum": 39,
        "vote_count": 39,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6989943180429",
        "created_at": "2022-06-16T22:06:39Z",
        "updated_at": "2022-06-21T17:23:51Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6989943180429.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6990338317581,
        "body": "<p>The player chat report feature is a horrible idea overall. It should not be up to you guys what I say on a server I host, or anyone else hosts for that matter. I would slightly understand this system being on realms only, as you guys actually host those servers, even then I'm paying for it. But there is absolutely no reason for this system on privately hosted servers, this system will end up a failure just like the bedrock version of it. There will be false bans and false punishments just like the bedrock version, glitches that cause players not to be able to play minecraft at all, and more.</p>\n<p>&nbsp;</p>\n<p>Also, since when was profanity not allowed in Java Edition. This has NEVER been a thing up until very recently, your own developers have been seen swearing on servers FOR YEARS. Seriously disappointed in the direction Minecraft has been heading for the past few years, and this has cemented my doubt in your team.</p>",
        "author_id": 385658889092,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6990338317581",
        "created_at": "2022-06-16T22:22:18Z",
        "updated_at": "2022-06-21T17:23:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6990338317581.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6990499667725,
        "body": "<p>The report feature is ok, but only for realms and MAYBE partnered servers (are those a thing?). For third party servers (whatever the size) it should be OPT-IN (NOT opt-out), left to the owner to choose. If it's absolutely necessary you could provide (\"forcefully\" to everyone) a function to report a whole server, to have it THOROUGHLY investigated, and only in the dire cases</p>",
        "author_id": 6990374734861,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6990499667725",
        "created_at": "2022-06-16T22:31:52Z",
        "updated_at": "2022-06-20T07:35:23Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6990499667725.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6990639053325,
        "body": "<p>As the Lead Developer and Head-Administrator (or technically Co-Owner) on a Skyblock/KitPvP RPG network (Celestial Skies), I'll give my opinion on the chat reporting feature.</p>\n<p>For realms, this is a good idea since Microsoft hosts these. But for third-party servers (servers that are hosted by other companies or on our machines rather than by Microsoft), this will just create a lot of work for Microsoft and removes control from the owners who run these servers.</p>\n<p>Each server should be able to decide how they want to handle and run their community. Some servers allow profanity and I've seen some that is anarchy.</p>\n<p>On the network we run, we have a small team of staff members that help with moderation, administration, development, and building. Our moderation and administration help with reports, helping players on how to play, improving the community, etc.</p>\n<p>Having this chat report feature on third-party servers would take power away from us on how to run our servers and even in some way possible, the job of moderators on these servers.</p>\n<p>Unless this feature sends a report to the mods/admins of the server the player is on, or we get an option to opt-out from this feature, this shouldn't be added.</p>",
        "author_id": 6990087251469,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6990639053325",
        "created_at": "2022-06-16T22:36:14Z",
        "updated_at": "2022-06-22T01:06:51Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6990639053325.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6990612648461,
        "body": "<p>I understand that you want people to be nice when chatting but come on, please don't ban us just for friendly swearing. If someone is being legitimately rude, the admins/mods or the owner can just ban them. Lots of people like to swear including myself because imo it really adds emphasis on things. I highly recommend you drop this.</p>",
        "author_id": 6990568797197,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6990612648461",
        "created_at": "2022-06-16T22:37:53Z",
        "updated_at": "2022-06-20T07:35:29Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6990612648461.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6992200226061,
        "body": "<p>Leave the moderating in the hands of sever owners and moderators, this is stupid and does far more harm than good.</p>",
        "author_id": 396713906932,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6992200226061",
        "created_at": "2022-06-16T23:55:13Z",
        "updated_at": "2022-06-21T17:24:32Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6992200226061.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6993476601613,
        "body": "<p>No chat reporting. Please.</p>",
        "author_id": 396964132271,
        "vote_sum": 29,
        "vote_count": 29,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6993476601613",
        "created_at": "2022-06-17T00:54:14Z",
        "updated_at": "2022-06-21T17:24:29Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6993476601613.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6993513719181,
        "body": "<p>This is the worst thing I've heard in a while, let server owners run their server how they want. Having a global censorship system is ridiculous and not in the spirit of how Java edition is designed.</p>",
        "author_id": 6993393317389,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6993513719181",
        "created_at": "2022-06-17T00:56:06Z",
        "updated_at": "2022-06-20T07:35:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6993513719181.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6994864385293,
        "body": "<p>1.19.1 the downfall of multiplayer&nbsp;</p>",
        "author_id": 6994869738381,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6994864385293",
        "created_at": "2022-06-17T02:21:48Z",
        "updated_at": "2022-06-21T17:24:37Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6994864385293.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6995406817165,
        "body": "<p>Remove forced player censorship. Server owners should be able to mute/ban players at their own leisure, and adult community servers should be left untouched.</p>",
        "author_id": 6995396799501,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6995406817165",
        "created_at": "2022-06-17T03:18:10Z",
        "updated_at": "2022-06-21T17:24:41Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6995406817165.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6995459539469,
        "body": "<p>Sorry, but I don't think I should be permanently banned for calling somebody a disingenuous, dense mother fucker, who can't tie their shoes on an anarchy server where prime actively participate in doxing or that I should be permanently banned from MINECRAFT as a whole because I made a dick joke in hypixel</p>",
        "author_id": 6995425765389,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6995459539469",
        "created_at": "2022-06-17T03:23:58Z",
        "updated_at": "2022-06-19T23:17:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6995459539469.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6995674358413,
        "body": "<p>just leave it to the server admins, literally nobody is asking for this feature</p>",
        "author_id": 399311671111,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6995674358413",
        "created_at": "2022-06-17T03:52:06Z",
        "updated_at": "2022-06-19T00:39:45Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6995674358413.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996024844813,
        "body": "<p>Chat censorship should be an optional feature that can be toggled in server.properties as this could be bad for anarchy servers or private servers (such as a SMP). This also should not be in LAN worlds.</p>",
        "author_id": 6996004315021,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996024844813",
        "created_at": "2022-06-17T04:44:09Z",
        "updated_at": "2022-06-20T07:36:01Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996024844813.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996083396237,
        "body": "<p>Not a fan of the chat reporting feature.&nbsp;</p>",
        "author_id": 6996067958157,
        "vote_sum": 18,
        "vote_count": 18,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996083396237",
        "created_at": "2022-06-17T04:52:04Z",
        "updated_at": "2022-06-19T00:39:55Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996083396237.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996250768013,
        "body": "<p>Just so you know, there are plenty of Java Edition mods that can add more content than any future updates to the base game can.</p>",
        "author_id": 378842547612,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996250768013",
        "created_at": "2022-06-17T05:13:30Z",
        "updated_at": "2022-06-17T20:41:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996250768013.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996341076749,
        "body": "<p>The chat moderation needs dropped. It is not the responsibility of Mojang nor Microsoft to handle chat issues on private servers. Pretty much any major server already has rules and moderators to enforce those rules, and each server has its on player environment so the rules on what can and can't be said are different. A top down rule list like this will most likely lead to a decrease in server activity and the number of servers period. Everyone understands that online play is is going to potentially lead to some unwanted words, but it needs to be left in the server owners hands.&nbsp;</p>",
        "author_id": 6996325022989,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996341076749",
        "created_at": "2022-06-17T05:30:53Z",
        "updated_at": "2022-06-19T00:40:17Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996341076749.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996434675981,
        "body": "<p>I don’t think the report function fits Minecraft very well. Minecraft is so big and so many different people play it. I think a better use of this function would be to make it report players to the admin of the given server. This would make report systems much more simpler on server while still allowing people to say what they want. If players are sharing truly awful information with each other, maybe set up a system where admins of a server can send the chat logs to Microsoft who then could ban the players. But as it stands this report system is awful and will lead to a lot of unnecessary bans to people</p>",
        "author_id": 398138402152,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996434675981",
        "created_at": "2022-06-17T05:38:31Z",
        "updated_at": "2022-06-19T00:40:37Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996434675981.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996571792909,
        "body": "<p>No, don't implement player reporting. Let server admins moderate their own servers, we don't want moderation to be centralised. What about servers where they allow their players to say whatever they want? If reports went through server, the server admins could make fake reports. If reports went through clients by sending recent chat messages received from the server, the players could create fake reports using a mod. If everyone's chat messages are sent to Microsoft from clients and Microsoft see that chat when someone reports, you can use a mod to just not send chat messages to Microsoft. It's not going to work</p>",
        "author_id": 6996536578573,
        "vote_sum": 22,
        "vote_count": 22,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996571792909",
        "created_at": "2022-06-17T06:05:09Z",
        "updated_at": "2022-06-17T23:28:02Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996571792909.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996715591693,
        "body": "<p>Chat reporting is probably the worst idea ever, just remove it.</p>",
        "author_id": 409329600812,
        "vote_sum": 9,
        "vote_count": 9,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996715591693",
        "created_at": "2022-06-17T06:19:32Z",
        "updated_at": "2022-06-17T23:28:04Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996715591693.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6996866868493,
        "body": "<p>I think the new chat moderating idea is not good at all. Like the owners of servers have been doing a good work keeping their communities on check for so many years and you suddenly want to take all that away from them and have the reports directed to you? What would be the consequences of a report for using bad words? Would we get permanently banned from multiplayer or never be able to speak in chat again? Servers like 2b2t would be gone in a instance and they hold great value in the Minecraft community. Please reconsider your actions and don't implement this change. Thank you</p>",
        "author_id": 6996752421133,
        "vote_sum": 8,
        "vote_count": 8,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6996866868493",
        "created_at": "2022-06-17T06:41:32Z",
        "updated_at": "2022-06-19T00:41:22Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6996866868493.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6997272493581,
        "body": "<p>As a server owner, my players (who are my close friends) sometimes play pranks without really thinking about the consequences, I can see them mass reporting as a prank, without really meaning anything. Also, swearing is pretty frequent for a few of them, so I would really like to be able to turn it off, maybe in the server.properties file. I hope that at least there will be a mod or plugin that disables it. At least block those who do not have permissions from reporting, I can see large servers going down because of reporting.</p>",
        "author_id": 6997265919117,
        "vote_sum": 7,
        "vote_count": 7,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6997272493581",
        "created_at": "2022-06-17T07:38:12Z",
        "updated_at": "2022-06-19T00:41:27Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6997272493581.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6997292711693,
        "body": "<p>No, let the server admins do their thing, the last thing we want is Microsoft spying on our private servers cuz some kid pressed a report button, also that's why servers have staff, to help manage and control their environment, Each server has its rules some may be different for others. one server allows cheating and no chat rules, for example, Hypixel does not. each server has its way don't bring us bedrock moderation to java. let java have its freedom!</p>\n<p>&nbsp;</p>\n<p>The chat idea is a terrible idea 100% in every way what are you thinking?</p>",
        "author_id": 6066368124685,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6997292711693",
        "created_at": "2022-06-17T07:39:11Z",
        "updated_at": "2022-06-19T00:41:30Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6997292711693.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6997807607693,
        "body": "<p>The chat reporting feature might not be a good idea if it is mandatory. Why ? Well because servers already moderate their communities in the fairest way possible using plug-ins. Another problem is that while focusing on a feature we don't really need, you loose some time that could be used to create real content and so you continue disappointing player by the amount in each update. I know player safety is important but it already exists almost on every server and why would a group of friends need this feature on their small SMP ? You could make that feature optional and add an icon next to server names that tells the player if the server is either \"safe\" or not. How about anarchy servers that just shouldn't have any moderation ?</p>",
        "author_id": 6997092397197,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6997807607693",
        "created_at": "2022-06-17T08:38:17Z",
        "updated_at": "2022-06-20T07:36:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6997807607693.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6998426523021,
        "body": "<p>Do not add chat reporting to the game, or any form of centralized moderation.</p>",
        "author_id": 404300699592,
        "vote_sum": 15,
        "vote_count": 15,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6998426523021",
        "created_at": "2022-06-17T09:53:46Z",
        "updated_at": "2022-06-19T00:41:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6998426523021.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6998689912461,
        "body": "<p>Too many people have said it already but chat moderation should ALWAYS be up to the server owners and staff and should be fully in their control. Being moderated by paid workers at mojang breaches the private and self hosted feel of minecraft servers, and removes our ability to write our own rules.</p>",
        "author_id": 6998679234061,
        "vote_sum": 9,
        "vote_count": 9,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/6998689912461",
        "created_at": "2022-06-17T10:19:43Z",
        "updated_at": "2022-06-19T00:41:49Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/6998689912461.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7000233912973,
        "body": "<p>As with many others here, I have relatively negative views of the new chat reporting feature. Minecraft has always been a game about player freedom, and there are servers with older audiences that would like to be able to talk about more adult topics. Every big server that has kids on it has been already doing a fine job of moderation, and the servers without kids have been benefiting greatly from their looser chat restrictions. Please do not add this feature.</p>",
        "author_id": 7000187000205,
        "vote_sum": 7,
        "vote_count": 7,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7000233912973",
        "created_at": "2022-06-17T12:12:33Z",
        "updated_at": "2022-06-19T00:41:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7000233912973.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7002066109581,
        "body": "<p>Copy/pasting from my twitter replies to slicedlime.</p>\n<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Chat reporting should either remain on Realms (which are hosted by MS/Mojang) or as an opt-in flag you can set via server.prop. Most Java servers are hosted outside of Realms, and I'd argue that puts it out of MS' reach.</span></p>\n<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">This has the potential to kill some adult oriented servers, specifically roleplaying and anarchy where less than favorable language and topics run rampant (and are typically allowed in one way or another).</span></p>\n<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">tl;dr this is a *bit* of an overreach</span></p>",
        "author_id": 385274246891,
        "vote_sum": 10,
        "vote_count": 10,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7002066109581",
        "created_at": "2022-06-17T13:27:52Z",
        "updated_at": "2022-06-18T05:12:14Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7002066109581.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7002281184909,
        "body": "<p>Please do not add chat reporting. That should be up to the server owners, not Mojang/Microsoft.</p>\n<p>Also, being vague and not giving us more context/information about the chat reporting really isn't helping.</p>",
        "author_id": 394644014311,
        "vote_sum": 9,
        "vote_count": 9,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7002281184909",
        "created_at": "2022-06-17T13:36:57Z",
        "updated_at": "2022-06-19T00:42:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7002281184909.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7002767730189,
        "body": "<p>idk why but i think that night is a little bit longer</p>",
        "author_id": 5264982310669,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7002767730189",
        "created_at": "2022-06-17T13:56:30Z",
        "updated_at": "2022-06-17T15:37:51Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7002767730189.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7004240390541,
        "body": "<p>The Player Report Feature is something we all don't wanna see. The Reports, Mutes or the Bans for Hacking or Swearing should be handled by the servers not Microsoft or Mojang. Please just remove this Feature. It will be controversial and some people might quit!</p>",
        "author_id": 6970363105933,
        "vote_sum": 14,
        "vote_count": 14,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7004240390541",
        "created_at": "2022-06-17T14:46:07Z",
        "updated_at": "2022-06-30T09:18:55Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7004240390541.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7007361645069,
        "body": "<p>Speaking as a helper on a major server network<br><br>The chat moderation should be an opt out thing..sure have it opted in by default but chat moderation is our job not yours.....sure we appreciate the idea of keeping out the trolls is appreciated but we can moderate our own chat...<br><br></p>",
        "author_id": 7007262459021,
        "vote_sum": 8,
        "vote_count": 8,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7007361645069",
        "created_at": "2022-06-17T16:28:22Z",
        "updated_at": "2022-06-21T17:22:37Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7007361645069.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7009149712397,
        "body": "<p><strong>Don't implement the user report feature</strong>, it can easily be abused on Minecraft servers owned by people who make things their way. Which could cause innocent players to be banned from playing on the servers that they love and pose security risks if staff members of a Minecraft server are banned.<br><br>My suggestion would be to remove this report idea from the patch.</p>",
        "author_id": 7009076239373,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7009149712397",
        "created_at": "2022-06-17T17:31:58Z",
        "updated_at": "2022-06-21T17:22:23Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7009149712397.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7009377038733,
        "body": "<p>I feel that chat reporting would be an amazing tool- for server admins and moderators. an inbuilt way to to report bad users to the moderators, and bad **servers** to mojang, feels like a very good idea. however, different servers have different standards, and reporting individuals to mojang is not a good solution.</p>",
        "author_id": 423022810471,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7009377038733",
        "created_at": "2022-06-17T17:38:15Z",
        "updated_at": "2022-06-20T07:33:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7009377038733.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7010491143437,
        "body": "<p>There should be a toggle for private 3rd party servers to opt-in/out of this. Considering how most of the community seems to be against this, this would just lead to the increase in popularity of cracked servers indirectly encouraging piracy. </p>",
        "author_id": 423958861851,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7010491143437",
        "created_at": "2022-06-17T18:17:04Z",
        "updated_at": "2022-06-21T17:22:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7010491143437.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7014716441613,
        "body": "<p>Keep the report feature out of custom servers, because not only this opens up issues from the abusers who just report everything. Only the server owners should be responsible for this type of thing and it is up to them to keep their server friendly or not.</p>",
        "author_id": 402383447511,
        "vote_sum": 8,
        "vote_count": 8,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7014716441613",
        "created_at": "2022-06-17T20:51:17Z",
        "updated_at": "2022-06-20T04:59:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7014716441613.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7014764924301,
        "body": "<p>What are you thinking adding player chat reporting??? This takes away control from servers that have been moderating themselves for over 10 years, and most likely will be abused by irresponsible users! This is the worst idea proposed in minecraft since it was released and needs to be prevented! Please take your community seriously Mojang :)</p>",
        "author_id": 7014613664013,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7014764924301",
        "created_at": "2022-06-17T20:51:39Z",
        "updated_at": "2022-06-21T17:21:23Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7014764924301.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7015946752141,
        "body": "<p>I think chat reporting is a good thing, but most Minecraft players likely do not know the Minecraft Community Standards exist.</p>\n<p>The Minecraft Community Standards are the basis for Mojang’s in-game moderation efforts, but they’re not mentioned anywhere in any of the current Minecraft games nor are they prominently linked or discoverable on the Minecraft website.</p>\n<p>Minecraft Earth was the only game to make players aware of the Community Standards. They were prominently linked in the navigation bar on the Minecraft Earth product page on the Minecraft website and linked within the game settings.</p>\n<p>The Minecraft Community Standards were originally published in 2019 and as of today are currently only referenced and/or linked to (in relation to the game) in:</p>\n<ul>\n<li>Bedrock’s in-game notice a player receives <em>after</em> they’ve been banned</li>\n<li>The support article about in-game bans</li>\n</ul>\n<p>The Community Standards page itself is only discoverable from the link within the support article and two Minecraft website blog posts—the original announcement about moderation in Bedrock and the 22w24a snapshot changelog.</p>\n<p>The criteria for moderation action is also only clearly listed within the support article and not the Community Standards themselves.</p>\n<p>If Mojang wants their moderation efforts to be accepted and successful, they need to ensure the Minecraft Community Standards are clear, direct, and prominently and readily accessible for players to review before engaging in any aspects of the game and online multiplayer.</p>",
        "author_id": 364952160192,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7015946752141",
        "created_at": "2022-06-17T21:42:16Z",
        "updated_at": "2022-06-19T23:00:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7015946752141.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7016096771213,
        "body": "<p>I really don't like this chat report feature. I strongly believe that moderation should be left up to the server's own moderators.</p>\n<p>Centralized moderation is a <em>bad </em>idea. Things that are 100% okay on one server may be completely against the rules on another. Players shouldn't be banned from all servers just because they broke the rules on one server. The system is ripe for abuse.</p>\n<p>I really hope the dev team reconsiders adding chat reporting.</p>",
        "author_id": 381713767952,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7016096771213",
        "created_at": "2022-06-17T21:53:06Z",
        "updated_at": "2022-06-21T17:20:43Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7016096771213.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7017631454733,
        "body": "<p><em><strong>BLUF: </strong><strong>Microsoft/Mojang managed chat is VERY BAD</strong></em></p>\n<p>As you should be able to see, <em><strong>everyone </strong></em>who cares to look into what's coming next for the game is here, and on other sources telling you that you are making a mistake with the chat moderation feature. I personally have seen clients that can send false data of all sorts to servers,.. with this update you would be giving people a way to falsely punish good players because they want to, for no reason other than to cause chaos. Many people love to troll people and abuse mechanics for political reasons (troll farms) or just because they are a <em>very mean person</em>. Additionally rules for servers change from server to server. One may allow for sexual content to be discussed, while another may not, but may allow profanity.</p>\n<p>You can make an annoying pop-up that says \"multiplayer servers are not run or supported by Microsoft/Mojang\" and leave it at that.</p>",
        "author_id": 401781668152,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7017631454733",
        "created_at": "2022-06-17T23:14:59Z",
        "updated_at": "2022-06-21T17:20:39Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7017631454733.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7018139172493,
        "body": "<p><strong>NO to the \"Player Chat Reporting feature\"!</strong> Why should you control what people say on a <strong>private server (Player-Hosted)?</strong></p>\n<p>It should be up to the server <strong>Mods - Admins to mute / ban people.</strong></p>\n<p>&nbsp;</p>\n<p>Isn't it better if you just have it on <strong>Mojang-Hosted servers (Realms)?</strong></p>",
        "author_id": 7018034024973,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7018139172493",
        "created_at": "2022-06-17T23:53:46Z",
        "updated_at": "2022-06-21T17:20:33Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7018139172493.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7021756818189,
        "body": "<p>Like everyone else discussing the chat moderation feature, I don't think it will end well.</p>\n<p>Take a look at Hypixel, currently the largest Java Edition server. Most of the reports people submit will gain an automated response, with many unfair rulings given out because they don't trust the players. That's just one server, above <em>thousands</em> if not <em><strong>millions</strong></em><em> </em>of servers. If Mojang or even Microsoft handles every report, either it will have to follow the same route of unfair automated rulings, or many more staff will need to be hired to keep on pace.</p>\n<p>Speaking of these rulings, we have no transparency on what would even happen if the moderation team decides someone was naughty enough. Obviously there's some punishment, but how? If you're punishing in the offending server, then you're controlling third party servers who would have their own moderation. If you're punishing across the game as a whole, then an action that might be fine in the offending server will get you muted, or worse, across every server where you might follow that community's rules.</p>\n<p>&nbsp;</p>\n<p>Regardless, the report feature as it's presented has you overstepping your bounds to control what's right or wrong in communities you don't own. It will be awful in literally every single step of the process, being abused by players and overwhelming your staff, as well as potentially wrongly punishing a player. There needs to be a way to disable it entirely, or at least make the server owner/admin the middle man.</p>",
        "author_id": 7021615953165,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7021756818189",
        "created_at": "2022-06-18T05:11:35Z",
        "updated_at": "2022-06-24T07:45:02Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7021756818189.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7022268064269,
        "body": "<p>Completely against moderating decentralized 3rd-party servers. Every server has a right to manage and moderate their respective communities as they see fit. Remove the player-reports for 3rd-party servers, or at the very least make it opt-in!</p>",
        "author_id": 7022236956813,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7022268064269",
        "created_at": "2022-06-18T06:36:13Z",
        "updated_at": "2022-06-21T17:20:19Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7022268064269.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7023868449293,
        "body": "<p>I strongly disagree with the new chat reporting feature. Many players are adults and people can moderate their own servers with no problems. Private servers should stay private and Mojang should not be able to moderate them because players can choose their own rules and can moderate fine on their own. This is a huge step in a wrong direction and Im sure the community is not taking this well at all. Java edition has always been about freedom and this bedrock reporting feature is taking it away. Players should choose what is allowed on their servers on their own and this report system is going to get abused really hard. If you all really read feedbacks I hope I dont see this chat reporting feature added in a full release. Now if the reports are going to THE SERVER OWNERS/MODS then I could understand the feature and It could be a good idea, but if its MOJANG/MICROSOFT then this thing has to stop.</p>",
        "author_id": 7023835149709,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7023868449293",
        "created_at": "2022-06-18T10:25:15Z",
        "updated_at": "2022-06-21T17:19:52Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7023868449293.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7024224626573,
        "body": "<p>The player chat report feature is a horrible idea. It should be on just the server owners/admins to take action against possibly harmful chatting, not the big brother mojang/microsoft itself. I'm highly against the current chat report feature and would discourage adding it to the game. It will do more harm than good.</p>",
        "author_id": 7024203764365,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7024224626573",
        "created_at": "2022-06-18T11:11:43Z",
        "updated_at": "2022-06-21T17:19:48Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7024224626573.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7030509923981,
        "body": "<p>Please do not institute this terrible new chat reporting system over all servers. There's no reason that I should be able to be banned from all minecraft servers for swearing because I swore on my private server that I maintain myself on my own machine. Want to add it to realms? Where Microsoft themselves own the servers? Sure! go ahead. It's a terrible idea, but I can't argue with that, you guys own the servers. But existing, PRIVATE servers? What a godawful idea. There was absolutely no issue with letting servers handle their own moderation beforehand, I don't get the issue now.</p>\n<p>People aren't going to take this, so one of two things will happen.</p>\n<p>1. Everyone stays on 1.19/earlier versions</p>\n<p>2. A ton of people crack their copies and make cracked servers to stay on the latest version while not falling under this censorship.</p>\n<p>This is a lose/lose situation for the players and Microsoft</p>",
        "author_id": 378312354271,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7030509923981",
        "created_at": "2022-06-18T18:18:55Z",
        "updated_at": "2022-06-21T17:19:36Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7030509923981.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7031238824077,
        "body": "<p>In my opininon chat reporting feature is the worst idea for a long time, it is a feature that will ruin the entire idea and freedom of minecraft, private servers are supposed to be moderated by their respective owners and i can see a lot of innocent players getting banned for out-of-context chat messages or just because the rules of chat moderating are unspecifed by mojang. Also the idea that Mojang employees moderate every 1.19.1 server out there is scary, and i think that the chat blocking feature is enough. Sounds a little \"Big Brother\" to me.</p>\n<p>Honestly this makes me sad, (in my opinion) one of the reasons that minecraft has been so popular is the creativity and freedom that it gives to the player and the responisiblites that come with it,each server has their own community and rules, that's the selling point of Java Edition</p>",
        "author_id": 6784817288205,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7031238824077",
        "created_at": "2022-06-18T19:13:00Z",
        "updated_at": "2022-06-21T17:19:22Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7031238824077.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7031782136973,
        "body": "<p>weçkrwe</p>\n<p>marcelo drv</p>",
        "author_id": 7031811321485,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7031782136973",
        "created_at": "2022-06-18T19:57:54Z",
        "updated_at": "2022-06-18T19:57:55Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7031782136973.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7033713965197,
        "body": "<p>The chat reporting feature is a very bad idea. You do not own any of the private servers we play on. You have no ownership of them nor their chat behaviors. That is up to the SERVER OWNERS, which is not you, to moderate. It is impractical, unnecessary, and overly controlling for a game platform that runs off people paying for their own servers to play the game. Until you pay for everyone's server setups, RAM, data, storage, etc, you have no right to moderate their chats.</p>",
        "author_id": 7033636576013,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7033713965197",
        "created_at": "2022-06-18T22:29:58Z",
        "updated_at": "2022-06-21T17:19:12Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7033713965197.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7041360823053,
        "body": "<p>Chat reporting feature is not <em><strong>OKAY</strong></em>!</p>\n<p>Server Moderation should be up to server's owner and not Mojang or Microsoft. Different servers have different rules. Not to mention, this feature can be easily abused, getting innocent people banned for absolute nothing. This take away server's privacy and freedom.</p>\n<p>This is a terrible idea on almost every level. It should only exist for Mojang-hosted server such as Minecraft Realms and not custom servers or at least, opt-out able and not forced. If this feature still get implemented I would expect a large increase in popularity of people that host and play cracked servers.</p>",
        "author_id": 7041317551757,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7041360823053",
        "created_at": "2022-06-19T13:25:36Z",
        "updated_at": "2022-06-21T17:18:52Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7041360823053.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7041892402829,
        "body": "<p>Player chat reporting has to be one of the worst ideas presented in the latest versions of the game. One of the main selling points of java is the control server owners get in the moderation process of THEIR servers. I really hope this feature gets roll'd back as the feedback from the community has been entirely negative.&nbsp;</p>",
        "author_id": 7041889708173,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7041892402829",
        "created_at": "2022-06-19T14:21:03Z",
        "updated_at": "2022-06-21T19:38:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7041892402829.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7042018417677,
        "body": "<p>player reporting is not good, especially for multiplayer servers like 2b2t</p>",
        "author_id": 417040829611,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7042018417677",
        "created_at": "2022-06-19T14:29:59Z",
        "updated_at": "2022-06-21T17:18:35Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7042018417677.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7042058455949,
        "body": "<p>THIS IS A TERRIBLE IDEA DO NOT ADD CHAT REPORTING IT UNDERMINES THE POINT OF MULTIPLAYER AND MINECRAFT OF IT BEING A SANDBOX GAME WITH THE SERVER OWNER HAVING ALL THE POWER, IMPLEMENTING THIS JUST TURNS JAVA INTO BEDROCK AND WILL KILL MINECRAFT</p>",
        "author_id": 365323839492,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7042058455949",
        "created_at": "2022-06-19T14:43:30Z",
        "updated_at": "2022-06-21T17:18:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7042058455949.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7042651004557,
        "body": "<p>It seems to me that this innovation is an excessive intervention in the life of both servers and players. There are many servers where aggressive chat behavior is allowed. On other servers, messages are moderated using moderators and plugins. So this innovation is complete nonsense and garbage</p>",
        "author_id": 7042582461709,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7042651004557",
        "created_at": "2022-06-19T15:26:55Z",
        "updated_at": "2022-06-21T19:44:16Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7042651004557.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7042667848077,
        "body": "<p>Player-ran Minecraft servers were originally indented to be their own separate thing, completely ran and managed by their respective owner. So please be more liberal and let server owners do their own things with their own server.</p>",
        "author_id": 7042665614733,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7042667848077",
        "created_at": "2022-06-19T15:29:32Z",
        "updated_at": "2022-06-21T19:46:54Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7042667848077.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7042865797005,
        "body": "<p>I'm sorry but this is a terrible idea, chat moderation on Mojang owned or affiliated servers? Sure, I'm all for it but private servers should be allowed to enforce whatever rules they like, Hypixel has it's own chat moderation, and some servers don't, and that is by choice. Forcing moderation onto players on servers which have no chat rules isn't okay, Minecraft is meant to be a game about freedom, not moderation.</p>",
        "author_id": 7042841732621,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7042865797005",
        "created_at": "2022-06-19T15:48:57Z",
        "updated_at": "2022-06-21T19:49:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7042865797005.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7043472070029,
        "body": "<p>I'm mostly concerned - and share this concern - with the report player functionality that has been introduced.</p>\n\n<p>Unfortunately while I see what is trying to be portrayed, it will absolutely not work for servers due to the decentralised nature around java player-owned servers as each server has their own set of rules and premises.</p>\n\n<p>Having this report feature will absolutely create a mountain of unneeded work in terms of sifting through reports, and the potential of abuse is extremely high including out of context reports, which ties back to owners supposed to be having control of what is said on their own server.</p>\n\n<p>A potential solution that has been shared around could be for the option to opt-in where by default they are opt-out but are given the choice.</p>\n\n<p>I hope the team Mojang highly consider changing or outright removing the feature, or make it for realms exclusive. </p>",
        "author_id": 374774292571,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7043472070029",
        "created_at": "2022-06-19T16:41:50Z",
        "updated_at": "2022-06-21T20:12:27Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7043472070029.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7044061127565,
        "body": "<p>honestly a little ridiculous. I mean the first time you access the servers screen it literally tells you that servers and server chats are NOT REGULATED BY MOJANG and now we're having our private servers be moderated by mojang? kind of ridiculous.. if you want chat moderation why not tell players to go to bedrock, since I'm pretty sure you can get it for free now if you own the java version of minecraft.&nbsp;</p>",
        "author_id": 7044083477773,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7044061127565",
        "created_at": "2022-06-19T17:33:37Z",
        "updated_at": "2022-06-27T13:19:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7044061127565.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7046727720205,
        "body": "<p>like lots, i found one issue with the snapshot, the chat reporting thing. Im not going to resay any of the reasons its bad, i would just like to support the movement</p>",
        "author_id": 392032849432,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7046727720205",
        "created_at": "2022-06-19T21:47:49Z",
        "updated_at": "2022-06-21T20:38:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7046727720205.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7054780840077,
        "body": "<p>Please reverse this decision! Minecraft not having any official censor are the reason free speech and projects like \"The uncensored library\" exists.<br><br><br></p>",
        "author_id": 381343533792,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7054780840077",
        "created_at": "2022-06-20T10:44:42Z",
        "updated_at": "2022-06-21T19:14:48Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7054780840077.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7060749026317,
        "body": "<p>Please don't do the chat censoring. Most kids play on bedrock anyways so please keep java for the more hardcore players. </p>",
        "author_id": 7060722785677,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7060749026317",
        "created_at": "2022-06-20T14:49:48Z",
        "updated_at": "2022-06-21T17:18:16Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7060749026317.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7064257621261,
        "body": "<p>The chat reporting is absolutly unnacceptable. Servers should be run the way the owners want to. If content isn't acceptable on one server, that does not mean that it is not acceptable on all. The lack of context will be a massive issue on these chat reports. I would highly recommend leaving moderation to the players, the way it always has been.</p>",
        "author_id": 405590086392,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7064257621261",
        "created_at": "2022-06-20T16:34:02Z",
        "updated_at": "2022-06-21T20:45:26Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7064257621261.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7067656463117,
        "body": "<p>I think that duplicating allays is a very good mechanism. But in this beta, you can create as many allays as you want with one single starting allay: it is overpowered. So I think you should add a condition for duplication: there must be a certain number of allays (e.g. 10) within a certain number of blocks (e.g. 15).</p>",
        "author_id": 4848909920781,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7067656463117",
        "created_at": "2022-06-20T18:25:02Z",
        "updated_at": "2022-06-21T10:13:50Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7067656463117.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7071186635917,
        "body": "<p>Chat moderation and reporting should only be an opt-in feature.</p>",
        "author_id": 392377473251,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7071186635917",
        "created_at": "2022-06-20T20:30:36Z",
        "updated_at": "2022-06-21T17:18:27Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7071186635917.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 7094212070029,
        "body": "<p>Adding a censorship method would be the worst decision they make, servers that users create are supposed to be a separate issue from Mojang, and the responsibility lies solely with the server owners. Anarchic servers where obviously there are no rules would be the most affected or conversations that in different countries can mean something different (especially in Latin America) could cause many misunderstandings, after all, the one who decides what is allowed and that an owner should not decide, not Microsoft.</p>",
        "author_id": 7094026990093,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/6968127104269-Let-s-talk-about-the-most-recent-snapshot-22w24a/comments/7094212070029",
        "created_at": "2022-06-21T17:18:01Z",
        "updated_at": "2022-06-22T15:05:45Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/6968127104269/comments/7094212070029.json",
        "post_id": 6968127104269,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360074379171,
    "expected_comment_count": 5,
    "actual_comment_count": 5,
    "status": "ok",
    "comments": [
      {
        "id": 360013389571,
        "body": "<p>they seem common in spectator mode but in a survival world i bet theyd be harder to find, esp if they stop them from generating very obviously above ground</p>",
        "author_id": 406200778271,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074379171-Make-Amethyst-Geodes-Rarer/comments/360013389571",
        "created_at": "2020-11-10T20:02:41Z",
        "updated_at": "2021-08-04T15:40:52Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074379171/comments/360013389571.json",
        "post_id": 360074379171,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013543792,
        "body": "<p>I created a survival world and tested how common they are and they are too common.</p>",
        "author_id": 402046596112,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074379171-Make-Amethyst-Geodes-Rarer/comments/360013543792",
        "created_at": "2020-11-17T22:25:47Z",
        "updated_at": "2020-11-18T03:37:45Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074379171/comments/360013543792.json",
        "post_id": 360074379171,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014159971,
        "body": "<p><x-zendesk-user data-user-name=\"Catty Osis\">406200778271</x-zendesk-user>&nbsp;I made a survival world to find out how long it took to get bundles and found 2 amethyst geodes (without looking for them) just sticking out of a river before I got my hands on that bundle.</p>",
        "author_id": 394286328392,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074379171-Make-Amethyst-Geodes-Rarer/comments/360014159971",
        "created_at": "2021-01-29T23:25:00Z",
        "updated_at": "2021-01-30T09:14:07Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074379171/comments/360014159971.json",
        "post_id": 360074379171,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014483571,
        "body": "<p>They are suposed to be exciting to find, but currently it is more like \"oh. Another one i guess\"<br>They should have spawnrates closer to Spawners</p>",
        "author_id": 381792993132,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074379171-Make-Amethyst-Geodes-Rarer/comments/360014483571",
        "created_at": "2021-02-27T19:22:56Z",
        "updated_at": "2021-02-27T19:22:59Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074379171/comments/360014483571.json",
        "post_id": 360074379171,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4406454898957,
        "body": "<p>Ikr, when I go boating in Minecraft I almost expect to find 2 or 3 geodes.</p>",
        "author_id": 416913468532,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074379171-Make-Amethyst-Geodes-Rarer/comments/4406454898957",
        "created_at": "2021-08-04T14:43:39Z",
        "updated_at": "2021-08-04T14:43:39Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074379171/comments/4406454898957.json",
        "post_id": 360074379171,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 21615896816653,
    "expected_comment_count": 3,
    "actual_comment_count": 3,
    "status": "ok",
    "comments": [
      {
        "id": 21653332873741,
        "body": "<p>they need to fix this it got so many redstoners excited but then they ruined it &gt;:(</p>",
        "author_id": 415561772631,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21615896816653-Give-Copper-Bulbs-1-tick-delay/comments/21653332873741",
        "created_at": "2023-11-25T01:06:56Z",
        "updated_at": "2023-11-30T17:45:54Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21615896816653/comments/21653332873741.json",
        "post_id": 21615896816653,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21729564690829,
        "body": "<p>Whilst I do think its good to have a 1 tick delay block, I do believe that copper bulbs are meant to fill a different purpose (as being copper but with light). Maybe instead of fighting for an extra usage for a block, we could ask for a brand new block that fulfils this purpose, making it have it's own identity.&nbsp;</p>",
        "author_id": 21729508733965,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21615896816653-Give-Copper-Bulbs-1-tick-delay/comments/21729564690829",
        "created_at": "2023-11-28T02:27:55Z",
        "updated_at": "2023-12-04T07:03:22Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21615896816653/comments/21729564690829.json",
        "post_id": 21615896816653,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21914207955853,
        "body": "<p>The Idea of a new block is good but why not two in one it’s so easy and would make so many happy because you do not only need a block that is one tick but also a block that has light an example is mambos wave board things like that would go and I don’t like the changes that you made mojang so why not reverse it?</p>",
        "author_id": 21914123085581,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21615896816653-Give-Copper-Bulbs-1-tick-delay/comments/21914207955853",
        "created_at": "2023-12-04T07:07:39Z",
        "updated_at": "2023-12-04T16:02:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21615896816653/comments/21914207955853.json",
        "post_id": 21615896816653,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 21411765106957,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 21417733587853,
        "body": "<p>The copper bulb delay needs to be reverted back from two ticks to one tick...</p>",
        "author_id": 383305275371,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21411765106957-Reduce-Tick-Delay-for-Copper-Bulbs-Crafters-Dispensers-and-Droppers/comments/21417733587853",
        "created_at": "2023-11-17T04:50:56Z",
        "updated_at": "2023-11-18T15:10:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21411765106957/comments/21417733587853.json",
        "post_id": 21411765106957,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21425966627853,
        "body": "<p>Copper bulbs lost their delay. It needs to be 1gt again.</p>",
        "author_id": 406393738072,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21411765106957-Reduce-Tick-Delay-for-Copper-Bulbs-Crafters-Dispensers-and-Droppers/comments/21425966627853",
        "created_at": "2023-11-17T14:10:25Z",
        "updated_at": "2023-11-18T15:10:42Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21411765106957/comments/21425966627853.json",
        "post_id": 21411765106957,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21490359210893,
        "body": "<p>I kind of think it'd be 30 minutes since Mojang still hand codes their features since, let's face it, JavaScript's a nightmare.&nbsp;<br>Regardless of that though, I wholly agree with your statement.</p>",
        "author_id": 424093369731,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21411765106957-Reduce-Tick-Delay-for-Copper-Bulbs-Crafters-Dispensers-and-Droppers/comments/21490359210893",
        "created_at": "2023-11-20T05:58:16Z",
        "updated_at": "2023-11-20T22:22:28Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21411765106957/comments/21490359210893.json",
        "post_id": 21411765106957,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21490365180941,
        "body": "<p>I kind of think it'd be 30 minutes since Mojang still hand codes their features. let's face it, JavaScript's a nightmare.&nbsp;<br>Regardless of that though, I wholly agree with your statement.</p>",
        "author_id": 424093369731,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21411765106957-Reduce-Tick-Delay-for-Copper-Bulbs-Crafters-Dispensers-and-Droppers/comments/21490365180941",
        "created_at": "2023-11-20T05:58:47Z",
        "updated_at": "2023-11-20T22:22:28Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21411765106957/comments/21490365180941.json",
        "post_id": 21411765106957,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360074472792,
    "expected_comment_count": 5,
    "actual_comment_count": 5,
    "status": "ok",
    "comments": [
      {
        "id": 360013402032,
        "body": "<p>Yes. I was literally going to post this</p>",
        "author_id": 403580920851,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472792-Leather-Added-in-the-Bundle-Recipe/comments/360013402032",
        "created_at": "2020-11-05T06:54:44Z",
        "updated_at": "2023-12-27T23:56:08Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472792/comments/360013402032.json",
        "post_id": 360074472792,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013402712,
        "body": "<p>I would disagree... since rabbit hides really need a proper functionally of its own. Besides rabbit hides can be obtained as \"gifts\" from cats when sleeping on a bed, so it makes it easy to get provided, you tame a cat from a village.</p>",
        "author_id": 379100376951,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472792-Leather-Added-in-the-Bundle-Recipe/comments/360013402712",
        "created_at": "2020-11-05T09:49:43Z",
        "updated_at": "2021-05-20T22:03:07Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472792/comments/360013402712.json",
        "post_id": 360074472792,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013444692,
        "body": "<p>I agree, but I would rather see rabbit hide renamed \"small hide\" or something like that and make it so that you can switch between leather and small hides easily -- one leather = four small hides, and the reverse, like it is now.</p>",
        "author_id": 387988318791,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472792-Leather-Added-in-the-Bundle-Recipe/comments/360013444692",
        "created_at": "2020-11-09T16:29:52Z",
        "updated_at": "2022-02-21T10:59:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472792/comments/360013444692.json",
        "post_id": 360074472792,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013447512,
        "body": "<p>I'm glad rabbit hides have a use now but I'm not sure if I like the recipe for bundles.</p>",
        "author_id": 394741626112,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472792-Leather-Added-in-the-Bundle-Recipe/comments/360013447512",
        "created_at": "2020-11-09T19:24:02Z",
        "updated_at": "2022-11-03T12:40:58Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472792/comments/360013447512.json",
        "post_id": 360074472792,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013908811,
        "body": "<p>the recipe for bundles is great as is- please don't change it</p>",
        "author_id": 398830310812,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472792-Leather-Added-in-the-Bundle-Recipe/comments/360013908811",
        "created_at": "2021-01-03T15:29:41Z",
        "updated_at": "2021-05-20T22:03:25Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472792/comments/360013908811.json",
        "post_id": 360074472792,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 26780375351821,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 26781043407629,
        "body": "<p>Perfeitamente, isso seria o ideal.</p>",
        "author_id": 26780971682189,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/26780375351821-Keep-old-piston-sounds-BUT-allow-them-to-be-silenced-using-honeycombs/comments/26781043407629",
        "created_at": "2024-05-16T17:27:03Z",
        "updated_at": "2024-05-16T17:27:03Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/26780375351821/comments/26781043407629.json",
        "post_id": 26780375351821,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 26781455674253,
        "body": "<p>I am a fan of mechanical sounds and I absolutely adore the old piston sound. The new update would honestly ruin the feel you get hearing dozens of pistons fire up in a gigantic piston door etc<br><br>And I just also thought that using wax to silence the pistons OR using the new sound on waxed pistons (because they sound kinda slippy ngl), this could be the solution!</p>",
        "author_id": 407330168531,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/26780375351821-Keep-old-piston-sounds-BUT-allow-them-to-be-silenced-using-honeycombs/comments/26781455674253",
        "created_at": "2024-05-16T17:40:21Z",
        "updated_at": "2024-05-16T18:33:00Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/26780375351821/comments/26781455674253.json",
        "post_id": 26780375351821,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 26790436168077,
        "body": "<p>The old sound made creations feel grand, big, awesome. Now they sound kinda underwhelming. Like the piston is nothing more then another door.</p>\n<p>I liked the old one better, I liked the feeling the old one gave better. The old one inspires me, tells me instantly what it does, it was perfect, or at least near enough for me to not know how to improve it. And at the end, those that want it changed, can always use a resourcepack.</p>\n<p>&nbsp;</p>\n<p>The honeycombs silencing would be cool too but, I like the sound.</p>",
        "author_id": 26790373087629,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/26780375351821-Keep-old-piston-sounds-BUT-allow-them-to-be-silenced-using-honeycombs/comments/26790436168077",
        "created_at": "2024-05-16T22:12:55Z",
        "updated_at": "2024-05-17T00:07:31Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/26780375351821/comments/26790436168077.json",
        "post_id": 26780375351821,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 26832289699341,
        "body": "<p>I think this is a great idea. Like mumbo showed in his video on this topic, sometimes you want big clanky mechanical noises and other times you want the quite so you can do your own sound design</p>",
        "author_id": 417568432632,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/26780375351821-Keep-old-piston-sounds-BUT-allow-them-to-be-silenced-using-honeycombs/comments/26832289699341",
        "created_at": "2024-05-18T14:59:02Z",
        "updated_at": "2024-05-18T16:12:17Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/26780375351821/comments/26832289699341.json",
        "post_id": 26780375351821,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 5381332919181,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 5447976986509,
        "body": "<p>I have a similar portal idea, although instead it allows transport through Deep Dark Cities much more easier. I like your use of echo shards though.</p>\n<p><a href=\"https://feedback.minecraft.net/hc/en-us/community/posts/5241259587213-Deep-dark-cities-portal%C2%A0\" rel=\"nofollow noreferrer\">https://feedback.minecraft.net/hc/en-us/community/posts/5241259587213-Deep-dark-cities-portal&nbsp;</a></p>\n<p>&nbsp;</p>",
        "author_id": 419991586432,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/5381332919181-A-new-item-for-the-Ancient-city-The-Murky-Mirror/comments/5447976986509",
        "created_at": "2022-04-11T01:17:17Z",
        "updated_at": "2022-07-09T18:46:41Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/5381332919181/comments/5447976986509.json",
        "post_id": 5381332919181,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 5593027140877,
        "body": "<p>I think this is a great idea!</p>",
        "author_id": 406718059152,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/5381332919181-A-new-item-for-the-Ancient-city-The-Murky-Mirror/comments/5593027140877",
        "created_at": "2022-04-17T05:34:25Z",
        "updated_at": "2022-07-09T18:46:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/5381332919181/comments/5593027140877.json",
        "post_id": 5381332919181,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6900898637453,
        "body": "<p>It would be cool and maybe more \"lore\" to have a craftable \"mirror portal\" that you would place somewhere and right click with the Murky mirror. It would also prevent you to be teleported at your last bed.&nbsp;</p>",
        "author_id": 407464463711,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/5381332919181-A-new-item-for-the-Ancient-city-The-Murky-Mirror/comments/6900898637453",
        "created_at": "2022-06-14T10:25:36Z",
        "updated_at": "2022-07-09T18:47:04Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/5381332919181/comments/6900898637453.json",
        "post_id": 5381332919181,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 8197252667533,
        "body": "<p>sounds a lot like a terraria copy. What if the mirror allows you to see, in its reflection, some elements of the past before the ancient civilization doom? like... i don't know, translating texts, revealing ghosts and original buildings...</p>",
        "author_id": 1901444287247,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/5381332919181-A-new-item-for-the-Ancient-city-The-Murky-Mirror/comments/8197252667533",
        "created_at": "2022-08-05T02:41:16Z",
        "updated_at": "2022-08-05T06:05:57Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/5381332919181/comments/8197252667533.json",
        "post_id": 5381332919181,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360077415152,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 4411972339469,
        "body": "<p>This makes sense</p>",
        "author_id": 400866167712,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077415152-Deepslate-Dungeons-and-Mossy-Cobbled-Deepslate/comments/4411972339469",
        "created_at": "2021-10-24T13:11:17Z",
        "updated_at": "2021-12-21T20:26:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077415152/comments/4411972339469.json",
        "post_id": 360077415152,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4448743847565,
        "body": "<p>Well, we got the deepslate dungeons in some way. :]</p>\n<p>I am just kidding, both your ideas would be really cool. Dungeons in genereal should be modernized at least a little bit.</p>",
        "author_id": 1905589458947,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077415152-Deepslate-Dungeons-and-Mossy-Cobbled-Deepslate/comments/4448743847565",
        "created_at": "2022-02-19T12:37:24Z",
        "updated_at": "2022-08-15T17:43:13Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077415152/comments/4448743847565.json",
        "post_id": 360077415152,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6230087581197,
        "body": "<p>yea this is a great idea! and it will be much smoother along the blocks</p>\n<p>&nbsp;</p>",
        "author_id": 6230027636365,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077415152-Deepslate-Dungeons-and-Mossy-Cobbled-Deepslate/comments/6230087581197",
        "created_at": "2022-05-14T13:14:36Z",
        "updated_at": "2022-08-15T17:43:10Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077415152/comments/6230087581197.json",
        "post_id": 360077415152,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 8433701453581,
        "body": "<p>I mean yeah we got mossy cobblestone GIVE deepslate some o dat green</p>",
        "author_id": 7887838661773,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077415152-Deepslate-Dungeons-and-Mossy-Cobbled-Deepslate/comments/8433701453581",
        "created_at": "2022-08-15T17:44:34Z",
        "updated_at": "2022-08-15T17:44:39Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077415152/comments/8433701453581.json",
        "post_id": 360077415152,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360077007591,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 360014338432,
        "body": "<p>There is actually a toggle for this so you can access it.</p>",
        "author_id": 366765816612,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077007591-Snapshot-1-17/comments/360014338432",
        "created_at": "2021-02-11T04:06:54Z",
        "updated_at": "2021-04-09T05:52:19Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077007591/comments/360014338432.json",
        "post_id": 360077007591,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014544071,
        "body": "<p>Yeah same and theres no toggle for it I checked everywhere </p>",
        "author_id": 390891440611,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077007591-Snapshot-1-17/comments/360014544071",
        "created_at": "2021-03-07T09:13:28Z",
        "updated_at": "2021-04-09T05:52:17Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077007591/comments/360014544071.json",
        "post_id": 360077007591,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360016731052,
        "body": "<p>as a bedrock player, i very much agree with this. but this does technically already exist. basically just join the minecraft beta program on google play.</p>",
        "author_id": 410129250391,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077007591-Snapshot-1-17/comments/360016731052",
        "created_at": "2021-06-11T01:34:44Z",
        "updated_at": "2021-06-11T01:50:39Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077007591/comments/360016731052.json",
        "post_id": 360077007591,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4409531724429,
        "body": "<p>he said \"I don’t have java edition and would like to see the snapshots personally on iOS\"&nbsp;</p>",
        "author_id": 1901739692787,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077007591-Snapshot-1-17/comments/4409531724429",
        "created_at": "2021-09-18T12:01:53Z",
        "updated_at": "2021-09-18T12:10:19Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077007591/comments/4409531724429.json",
        "post_id": 360077007591,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360076903191,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 360014205131,
        "body": "<p>Yes, I think moss should act more like vines than actual carpet. It would make it way more useful, and it makes sense.</p>",
        "author_id": 393361768931,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360076903191-Placing-Mossy-Carpet-Sideways-on-Blocks/comments/360014205131",
        "created_at": "2021-02-03T21:25:42Z",
        "updated_at": "2022-05-14T18:29:52Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360076903191/comments/360014205131.json",
        "post_id": 360076903191,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014208471,
        "body": "<p>If you can't have vertical slabs then why not have vertical carpets?</p>",
        "author_id": 366168897132,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360076903191-Placing-Mossy-Carpet-Sideways-on-Blocks/comments/360014208471",
        "created_at": "2021-02-04T05:02:23Z",
        "updated_at": "2021-04-22T23:33:36Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360076903191/comments/360014208471.json",
        "post_id": 360076903191,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4421033331469,
        "body": "<p>Xl8iu</p>",
        "author_id": 1902997967727,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360076903191-Placing-Mossy-Carpet-Sideways-on-Blocks/comments/4421033331469",
        "created_at": "2022-01-15T15:11:48Z",
        "updated_at": "2022-01-15T15:11:48Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360076903191/comments/4421033331469.json",
        "post_id": 360076903191,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6235195026957,
        "body": "<p>I think we should have a one block of painting</p>",
        "author_id": 6235241158541,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360076903191-Placing-Mossy-Carpet-Sideways-on-Blocks/comments/6235195026957",
        "created_at": "2022-05-14T18:29:37Z",
        "updated_at": "2022-05-14T18:29:42Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360076903191/comments/6235195026957.json",
        "post_id": 360076903191,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 21477034354061,
    "expected_comment_count": 3,
    "actual_comment_count": 3,
    "status": "ok",
    "comments": [
      {
        "id": 21499571581837,
        "body": "<p>yeah. after seeing the effect these two blocks had on the community with their timings, it baffles me how mojang would take that away.</p>",
        "author_id": 21499514662029,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21477034354061-Please-bring-back-the-speed-of-copper-lamps-and-crafter/comments/21499571581837",
        "created_at": "2023-11-20T15:04:44Z",
        "updated_at": "2023-11-20T22:22:29Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21477034354061/comments/21499571581837.json",
        "post_id": 21477034354061,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21514150981261,
        "body": "<p>Mojang/Microsoft probably don't care about the feedback</p>",
        "author_id": 21465826826509,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21477034354061-Please-bring-back-the-speed-of-copper-lamps-and-crafter/comments/21514150981261",
        "created_at": "2023-11-20T21:27:23Z",
        "updated_at": "2023-11-20T22:26:26Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21477034354061/comments/21514150981261.json",
        "post_id": 21477034354061,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21624148453517,
        "body": "<p>ok, for the crafter, i can understand that nerf. i find it fair as far as i can say. but the copper bulb is just unnaceptable, that one opened so many doors to mechanism that wasn't possible before.</p>",
        "author_id": 405010759792,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21477034354061-Please-bring-back-the-speed-of-copper-lamps-and-crafter/comments/21624148453517",
        "created_at": "2023-11-24T00:27:32Z",
        "updated_at": "2023-11-24T00:27:32Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21477034354061/comments/21624148453517.json",
        "post_id": 21477034354061,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360077038471,
    "expected_comment_count": 3,
    "actual_comment_count": 3,
    "status": "ok",
    "comments": [
      {
        "id": 360014338031,
        "body": "<p>Would be great for adventure maps</p>",
        "author_id": 396379619372,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077038471-The-size-of-Bundles-should-be-adjustible-using-commands/comments/360014338031",
        "created_at": "2021-02-17T12:04:28Z",
        "updated_at": "2023-02-05T13:33:37Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077038471/comments/360014338031.json",
        "post_id": 360077038471,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4403555236877,
        "body": "<p>it's really good idea for custom anarchy servers with custom crafting recipes so you can make it with like diamonds or netherite to upgrade it's size</p>",
        "author_id": 416282779272,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077038471-The-size-of-Bundles-should-be-adjustible-using-commands/comments/4403555236877",
        "created_at": "2021-06-22T17:12:16Z",
        "updated_at": "2023-02-05T13:33:36Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077038471/comments/4403555236877.json",
        "post_id": 360077038471,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 30810816524045,
        "body": "<p>yes 1000% yes you should also be able to customise what items can be put in a bundle say for example I only wanted wood blocks in a specific bundle i can white list all the blocks i want in the bundle maybe there is also a universal white/black list so no mater what bundles you make you can never put oak leaves in all bundles. you should also be able to customise the stack size of items within the bundle but only within the bundle so for example if i wanted a diamond sword to stack to 64 within a bundle but ONLY within a bundle i can do that but the stack size outside the bundle remains 1</p>",
        "author_id": 30810391096845,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077038471-The-size-of-Bundles-should-be-adjustible-using-commands/comments/30810816524045",
        "created_at": "2024-10-04T21:47:34Z",
        "updated_at": "2024-10-05T15:35:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077038471/comments/30810816524045.json",
        "post_id": 360077038471,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360074963592,
    "expected_comment_count": 12,
    "actual_comment_count": 12,
    "status": "ok",
    "comments": [
      {
        "id": 360013641412,
        "body": "<p>I'm 100% agree and I thought the exact same thing while playing in the new snapshot. it's just make sense doesn't it</p>",
        "author_id": 407001409212,
        "vote_sum": 9,
        "vote_count": 9,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360013641412",
        "created_at": "2020-11-27T00:26:28Z",
        "updated_at": "2023-04-02T07:07:03Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360013641412.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013658612,
        "body": "<p>I completely agree!</p>",
        "author_id": 396231878211,
        "vote_sum": 6,
        "vote_count": 6,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360013658612",
        "created_at": "2020-11-29T18:32:01Z",
        "updated_at": "2021-08-18T11:20:07Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360013658612.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013745632,
        "body": "<p>This was my exact idea when I saw the new model in the inventory</p>",
        "author_id": 387398973051,
        "vote_sum": 7,
        "vote_count": 7,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360013745632",
        "created_at": "2020-12-04T18:55:50Z",
        "updated_at": "2021-08-18T11:20:05Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360013745632.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013689371,
        "body": "<p>Perfect, exactly my thoughts.</p>\n<p>&nbsp;</p>\n<p>Going forward, (unless I'm wrong) we should follow the existing \"3d inventory model\" exclusively for placeable blocks and 2d portraits for holdable only items.&nbsp; Holdables can still have newer 3d models when held.</p>",
        "author_id": 407533061151,
        "vote_sum": 7,
        "vote_count": 7,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360013689371",
        "created_at": "2020-12-06T23:36:58Z",
        "updated_at": "2021-08-18T11:20:04Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360013689371.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013871112,
        "body": "<p>I think that there should be an option called \"3D Inventory Textures\" that could toggle 3D items and block models in the inventory. There could also be an option for holding it.</p>",
        "author_id": 384372155932,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360013871112",
        "created_at": "2020-12-17T20:44:22Z",
        "updated_at": "2021-08-18T11:20:00Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360013871112.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014177392,
        "body": "<p>Underrated Feedback Post</p>",
        "author_id": 408830545272,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014177392",
        "created_at": "2021-01-25T19:16:36Z",
        "updated_at": "2021-08-18T11:19:58Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014177392.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014191792,
        "body": "<p>Yes.\n<br />2D in inventory.\n<br />3D in hand.</p>\n\n<p>Very good idea.</p>",
        "author_id": 385788421311,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014191792",
        "created_at": "2021-01-26T21:55:48Z",
        "updated_at": "2021-08-18T11:19:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014191792.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014211331,
        "body": "<p>mojang should add this as an option for all items ingame! like by adding a folder called \"held\" or \"inHand\" in the models/items folder! this would give resource pack creators like me the option to do this for any item! limiting this feature to the trident is such a shame</p>",
        "author_id": 406262811171,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014211331",
        "created_at": "2021-02-04T13:53:16Z",
        "updated_at": "2021-08-18T11:19:51Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014211331.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014231831,
        "body": "<p>I agree with this one, the spyglass texture in the inventory should be 2d while on hand it's 3d</p>",
        "author_id": 397031979611,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014231831",
        "created_at": "2021-02-06T08:51:48Z",
        "updated_at": "2021-08-18T11:19:49Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014231831.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014482971,
        "body": "<p>100% agree. The way it is now just doesn't make sense</p>",
        "author_id": 400490697712,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014482971",
        "created_at": "2021-02-27T18:06:03Z",
        "updated_at": "2021-08-18T11:20:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014482971.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014540071,
        "body": "<p>I completely agree!&nbsp;</p>",
        "author_id": 407415481431,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014540071",
        "created_at": "2021-03-06T15:48:20Z",
        "updated_at": "2021-08-18T11:19:43Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014540071.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014832552,
        "body": "<p>Haha yes they added this!</p>",
        "author_id": 408830545272,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074963592-Spyglass-Texture-fixes/comments/360014832552",
        "created_at": "2021-04-07T13:07:29Z",
        "updated_at": "2021-08-18T11:20:41Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074963592/comments/360014832552.json",
        "post_id": 360074963592,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 13943082717965,
    "expected_comment_count": 19,
    "actual_comment_count": 19,
    "status": "ok",
    "comments": [
      {
        "id": 14000525893133,
        "body": "<p>The enchantment glint being removed from potions is a shame. Wish it was at least kept in Programmer Art</p>\n<p>I've never had an issue telling what potion is what, the colours are easily distinct enough to tell the difference.</p>\n<p>And even if they weren't, <em>I'm</em> the one who put the potions in my inventory, so I'd know what potions I am using anyway.&nbsp;</p>",
        "author_id": 409144946252,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14000525893133",
        "created_at": "2023-03-14T21:35:35Z",
        "updated_at": "2023-11-25T05:02:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14000525893133.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14006716545293,
        "body": "<p>Change back jukeboxes to emit varying redstone signal strengths depending on the disc. It is such  a convenient secret base activation device, while still keeping some security. </p>",
        "author_id": 14006679568781,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14006716545293",
        "created_at": "2023-03-15T02:18:27Z",
        "updated_at": "2023-11-17T10:22:41Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14006716545293.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14035402790669,
        "body": "<p>While taking the glint away from potions does make them feel less special I have had issues in the past telling the difference. I does not bother me too much.</p>\n<p>One thing potions really need is stackabilty. Like make them be stackable to 8 or 16 on inventory slots or just make them stackable in the bundle so using portions in your regular Minecraft experience is practical.</p>",
        "author_id": 421133312972,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14035402790669",
        "created_at": "2023-03-15T23:22:20Z",
        "updated_at": "2023-11-25T05:02:18Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14035402790669.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14043610490253,
        "body": "<p>This update has chat reporting, and as a result it is unfortunately a bad update.</p>",
        "author_id": 6971985324557,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14043610490253",
        "created_at": "2023-03-16T11:16:22Z",
        "updated_at": "2023-06-19T19:09:53Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14043610490253.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14110080483981,
        "body": "<p>how do i download minecraft 1.19</p>\n<p>&nbsp;</p>",
        "author_id": 14110099027597,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14110080483981",
        "created_at": "2023-03-18T08:55:27Z",
        "updated_at": "2023-06-16T23:33:07Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14110080483981.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14300641662477,
        "body": "<p>The player should be able to see the enchantment of the book when they move the cursor on the book inside of the chiseled bookshelf.</p>\n<p>&nbsp;</p>",
        "author_id": 14300649126541,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14300641662477",
        "created_at": "2023-03-25T08:44:02Z",
        "updated_at": "2023-11-17T10:23:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14300641662477.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14324352791821,
        "body": "<p>I noticed a glitch or something I'm able to hear the noise the Warden makes when he picks up on a trace from far away. I can't hear its heartbeat, but I still hear his noises</p>",
        "author_id": 14324355471117,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14324352791821",
        "created_at": "2023-03-26T17:58:01Z",
        "updated_at": "2023-03-26T17:58:01Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14324352791821.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14420404176141,
        "body": "<p>i think in minecraft 1.20 or 1.21 they should add red pandas to cherry blossom boimes and monkeys to jungles and idk</p>",
        "author_id": 14420362416909,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14420404176141",
        "created_at": "2023-03-29T19:27:27Z",
        "updated_at": "2023-10-01T11:20:50Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14420404176141.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14511183201549,
        "body": "<p>Auto-jump is more than off by default, it won't stay turned on with either the control settings or accessibility settings.</p>",
        "author_id": 14511156857869,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14511183201549",
        "created_at": "2023-04-02T08:43:33Z",
        "updated_at": "2023-08-24T01:41:08Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14511183201549.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14644425570957,
        "body": "<p>remove the difficulty lock its so annoying when i try to change difficulty but i remembered i locked it 1 yr ago and i have to use cheats just to change and im trying to get all achevments</p>",
        "author_id": 10815018678285,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14644425570957",
        "created_at": "2023-04-07T04:41:45Z",
        "updated_at": "2023-05-18T16:57:31Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14644425570957.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14699911701389,
        "body": "<p>Chat reporting system still exist with is bad, I pay for my server I should be the only rule-maker</p>",
        "author_id": 14699793154829,
        "vote_sum": 5,
        "vote_count": 5,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14699911701389",
        "created_at": "2023-04-10T11:18:35Z",
        "updated_at": "2023-11-17T10:31:04Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14699911701389.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 14936920797965,
        "body": "<p>there is a glitch with the readstone with chisled bookshelves when you take away a book the Readstone power stays the same</p>",
        "author_id": 14936901132813,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/14936920797965",
        "created_at": "2023-04-17T21:57:19Z",
        "updated_at": "2023-10-05T09:22:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/14936920797965.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 15688577590797,
        "body": "<p>De acuerdo, la instantánea previa al lanzamiento de la 1.20 tiene como un patron en los mundos planos... Un plan mundo he hecho y habian muchas aldeas.... Como un patrón...</p>",
        "author_id": 15688424467597,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/15688577590797",
        "created_at": "2023-05-11T16:38:09Z",
        "updated_at": "2023-10-05T09:22:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/15688577590797.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 16186166603277,
        "body": "<p>Remove chat reports for both bedrock and Java completely and never add them back. Atleast on the Java side servers handle chat reports fine on their own. Java has millions and millions of servers while bedrock unless you manually add them has only a few. Plz listen to the community for once in the few years you have had this game remove it and never add it back</p>",
        "author_id": 16186164089741,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/16186166603277",
        "created_at": "2023-05-27T07:58:56Z",
        "updated_at": "2023-11-17T10:29:13Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/16186166603277.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 17180385655309,
        "body": "<p>vg</p>",
        "author_id": 17180340016653,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/17180385655309",
        "created_at": "2023-06-29T08:15:11Z",
        "updated_at": "2023-10-05T09:22:17Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/17180385655309.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 19100474885389,
        "body": "<p>Remopve Chat reporting and stop surveiling your Players in their PRIVATE game you vile controll hungry human beings.</p>",
        "author_id": 19100367813901,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/19100474885389",
        "created_at": "2023-09-01T10:03:57Z",
        "updated_at": "2023-11-17T10:29:08Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/19100474885389.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 20119492931981,
        "body": "<p>得分</p>",
        "author_id": 20119474935053,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/20119492931981",
        "created_at": "2023-10-05T09:22:05Z",
        "updated_at": "2023-10-05T09:22:05Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/20119492931981.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 20119518599565,
        "body": "<p>万达舞蹈服都是达到大大发生发附属风喉紧凑此时据此行放假覅次大的</p>",
        "author_id": 20119474935053,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/20119518599565",
        "created_at": "2023-10-05T09:23:28Z",
        "updated_at": "2023-10-05T09:23:28Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/20119518599565.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21420288213773,
        "body": "<p>I really love how with the crafter has its signal output goes up to 9 instead of 15. It really makes the math for the redstone comparator a lot easier on my brain. Also something I wanted to point out I don't know if this is the right area to be posting on or not I do apologize if it's not but the changes with library villagers does not fix the problem but rather changes the rules on how someone going to get mending early game. Now back to the positive I really love the new Tuff blocks and copper blocks they both add to a really nice flair in Minecrafts already wonderful selection of blocks to work with. I really love the wind theme for the tuff blocks it vaguely reminds me of the art style used in the Legend of Zelda the wind Waker as well and the cut/brick sets look great too. And I love the industrial theme of the copper blocks Excellent work you guys. The trials dungeon I've only tried once and it was a blast(and a somewhat literal way too.)I'm not sure yet to make of the new Breeze mob yet. I get why you made it do knockback that throws the player of guard but maybe their might be another way you could use the breeze to throw the player off balance in a less annoying way, granted theirs no real easy way to throw someone off their groove and not be salty about it. All in all the new features you guys plan on putting in the game seem really solid. I know thats no small feet with such a large game on a aging code. You guys are doing great. Hope the next update will be a hit</p>",
        "author_id": 21420021582989,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13943082717965-Minecraft-Java-Edition-1-19-4-Feedback/comments/21420288213773",
        "created_at": "2023-11-17T09:37:14Z",
        "updated_at": "2023-11-18T23:27:48Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13943082717965/comments/21420288213773.json",
        "post_id": 13943082717965,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360077254092,
    "expected_comment_count": 8,
    "actual_comment_count": 8,
    "status": "ok",
    "comments": [
      {
        "id": 360014395751,
        "body": "<p>Or make it a helmet that covers the player's face so you can only see vibrations. And make it craftable with 2 of a new item as rare as wither skulls called a warden antenna, and an unenchanted netherite helmet.</p>",
        "author_id": 365613052831,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/360014395751",
        "created_at": "2021-02-22T17:51:31Z",
        "updated_at": "2021-03-11T16:54:12Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/360014395751.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014470792,
        "body": "<p>how do i download it?</p>\n<p>&nbsp;</p>",
        "author_id": 411570905692,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/360014470792",
        "created_at": "2021-02-23T16:48:53Z",
        "updated_at": "2021-02-23T18:27:35Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/360014470792.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014490372,
        "body": "<p>Like this idea, maybe amethyst should be incorporated as well to add to its lackluster functionality as of right now</p>",
        "author_id": 402443456232,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/360014490372",
        "created_at": "2021-02-24T21:38:48Z",
        "updated_at": "2021-10-14T02:04:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/360014490372.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014490511,
        "body": "<p>I Agree Imagine Going On A Theme Park Ride And Seeing The Vibrations For Activators In The Queue I Love This Idea.</p>",
        "author_id": 412081742451,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/360014490511",
        "created_at": "2021-03-01T03:26:37Z",
        "updated_at": "2021-03-01T03:32:00Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/360014490511.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360015663152,
        "body": "<p>This idea is great! I also think it would be so cool for there to be an item that makes you \"blind\" (you cant see anything) but gives you \"warden vision\" (moving entities glow). There's alot of ideas you can come up with for a concept like the deep dark or the warden.</p>",
        "author_id": 410681255872,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/360015663152",
        "created_at": "2021-05-29T02:21:07Z",
        "updated_at": "2022-04-16T02:38:45Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/360015663152.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4414405159693,
        "body": "<p>They don't need faint traces for accessibility, they already have subtitles.</p>",
        "author_id": 384115840171,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/4414405159693",
        "created_at": "2021-11-23T00:19:53Z",
        "updated_at": "2021-11-23T00:44:00Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/4414405159693.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4422289600013,
        "body": "<p>that way this can't see the wireless redstone</p>",
        "author_id": 409233446211,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/4422289600013",
        "created_at": "2022-01-21T10:20:28Z",
        "updated_at": "2022-09-13T00:47:48Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/4422289600013.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 5575053094413,
        "body": "<p>I hope an item like this gets added. If it can be crafted with the new Echo Shards, Ancient Cities would totally be worth exploring.</p>",
        "author_id": 423999566192,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077254092-Sculk-goggles-for-seeing-vibrations/comments/5575053094413",
        "created_at": "2022-04-16T02:38:35Z",
        "updated_at": "2022-04-16T03:49:14Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077254092/comments/5575053094413.json",
        "post_id": 360077254092,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 21417856202381,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 21537947648013,
        "body": "<p>Yes. Mojang, those two blocks were perfect on first snapshot. WHY DID YOU NERF THEM!?!?!?</p>",
        "author_id": 396996315712,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21417856202381-Revert-copper-bulb-nerf/comments/21537947648013",
        "created_at": "2023-11-21T14:16:05Z",
        "updated_at": "2023-12-26T02:08:54Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21417856202381/comments/21537947648013.json",
        "post_id": 21417856202381,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21538817887117,
        "body": "<p>Hear here</p>",
        "author_id": 396996315712,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21417856202381-Revert-copper-bulb-nerf/comments/21538817887117",
        "created_at": "2023-11-21T14:37:09Z",
        "updated_at": "2023-11-23T03:27:34Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21417856202381/comments/21538817887117.json",
        "post_id": 21417856202381,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 21686489772685,
        "body": "<p>It’s utterly baffling that they thought this was what people wanted, absolutely 0 people requested this change and it shows the blatant and ever growing disconnect that Mojang has with their playerbase.</p>",
        "author_id": 21686443495309,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21417856202381-Revert-copper-bulb-nerf/comments/21686489772685",
        "created_at": "2023-11-26T20:32:16Z",
        "updated_at": "2023-11-27T16:36:39Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21417856202381/comments/21686489772685.json",
        "post_id": 21417856202381,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 22669968884365,
        "body": "<p>Apparently, this change was to bring PARITY in bedrock and java redstone</p>",
        "author_id": 1903954941127,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/21417856202381-Revert-copper-bulb-nerf/comments/22669968884365",
        "created_at": "2023-12-26T02:10:03Z",
        "updated_at": "2023-12-26T02:10:03Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/21417856202381/comments/22669968884365.json",
        "post_id": 21417856202381,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360075061631,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 360014167411,
        "body": "<p>Great Idea!</p>",
        "author_id": 398830310812,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360075061631-Upside-Down-and-Side-Ways-Sculk-Sensors/comments/360014167411",
        "created_at": "2021-01-31T01:26:57Z",
        "updated_at": "2023-12-27T23:52:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360075061631/comments/360014167411.json",
        "post_id": 360075061631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014480892,
        "body": "<p>I like the idea for building, but it would be to powerful for the redstone</p>",
        "author_id": 385082068792,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360075061631-Upside-Down-and-Side-Ways-Sculk-Sensors/comments/360014480892",
        "created_at": "2021-02-24T13:07:38Z",
        "updated_at": "2023-12-27T23:52:39Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360075061631/comments/360014480892.json",
        "post_id": 360075061631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014489232,
        "body": "<p>How exactly? The range of its detection radius isn't being changed so nothing besides its placement is adjusted.</p>",
        "author_id": 366765816612,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360075061631-Upside-Down-and-Side-Ways-Sculk-Sensors/comments/360014489232",
        "created_at": "2021-02-24T20:33:50Z",
        "updated_at": "2023-12-27T23:52:40Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360075061631/comments/360014489232.json",
        "post_id": 360075061631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 27703567239821,
        "body": "<p>This could almost replace vertical slabs.</p>",
        "author_id": 21545826601869,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360075061631-Upside-Down-and-Side-Ways-Sculk-Sensors/comments/27703567239821",
        "created_at": "2024-06-19T14:50:19Z",
        "updated_at": "2024-06-19T16:00:46Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360075061631/comments/27703567239821.json",
        "post_id": 360075061631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360074917851,
    "expected_comment_count": 5,
    "actual_comment_count": 5,
    "status": "ok",
    "comments": [
      {
        "id": 360013733952,
        "body": "<p>'An Idea just hit ___! Wait... no, it just pointed dripstone'</p>",
        "author_id": 407309326472,
        "vote_sum": 7,
        "vote_count": 7,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074917851-Dripstone-Death-Message/comments/360013733952",
        "created_at": "2020-12-03T20:07:16Z",
        "updated_at": "2021-08-11T00:50:24Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074917851/comments/360013733952.json",
        "post_id": 360074917851,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014273032,
        "body": "<p>\"___ got impaled\"</p>",
        "author_id": 406262811171,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074917851-Dripstone-Death-Message/comments/360014273032",
        "created_at": "2021-02-04T13:45:30Z",
        "updated_at": "2021-06-18T00:48:56Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074917851/comments/360014273032.json",
        "post_id": 360074917851,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014538772,
        "body": "<p>\"[player]'s world was rocked\"</p>",
        "author_id": 400242893591,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074917851-Dripstone-Death-Message/comments/360014538772",
        "created_at": "2021-02-27T17:37:08Z",
        "updated_at": "2021-06-18T00:48:59Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074917851/comments/360014538772.json",
        "post_id": 360074917851,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014627492,
        "body": "<p>\"[name] was impaled on pointed dripstone\" for deaths from falling on a stalagmite;</p>\n<p>\"[name] was skewered by pointed dripstone\" for deaths by falling stalactites.</p>",
        "author_id": 409612421152,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074917851-Dripstone-Death-Message/comments/360014627492",
        "created_at": "2021-03-10T07:23:08Z",
        "updated_at": "2022-05-10T05:05:02Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074917851/comments/360014627492.json",
        "post_id": 360074917851,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 6332313616909,
        "body": "<p>There is already a death message for this on Java??? There is a post for adding Java death messages to Bedrock, that's probably what you want.</p>",
        "author_id": 5209025310477,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074917851-Dripstone-Death-Message/comments/6332313616909",
        "created_at": "2022-05-19T01:21:52Z",
        "updated_at": "2022-05-19T10:58:34Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074917851/comments/6332313616909.json",
        "post_id": 360074917851,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 13198484539021,
    "expected_comment_count": 3,
    "actual_comment_count": 3,
    "status": "ok",
    "comments": [
      {
        "id": 13336669389453,
        "body": "<p>Maybe also with transitions? Meaning in the morning and dawn its only half as bright.</p>",
        "author_id": 13336628620813,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13198484539021-Torch-Flowers-Lighting-up-at-night-specifically/comments/13336669389453",
        "created_at": "2023-02-22T19:17:24Z",
        "updated_at": "2023-03-05T17:31:36Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13198484539021/comments/13336669389453.json",
        "post_id": 13198484539021,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 13483902465293,
        "body": "<p>No, torch flowers should emit soft glow no matter what.</p>",
        "author_id": 387042794952,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13198484539021-Torch-Flowers-Lighting-up-at-night-specifically/comments/13483902465293",
        "created_at": "2023-02-28T04:19:53Z",
        "updated_at": "2023-02-28T04:19:59Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13198484539021/comments/13483902465293.json",
        "post_id": 13198484539021,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 13581344907021,
        "body": "<p>They could give of a redstone signal like the day light sensor&nbsp;</p>",
        "author_id": 13581063473421,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/13198484539021-Torch-Flowers-Lighting-up-at-night-specifically/comments/13581344907021",
        "created_at": "2023-03-01T17:54:27Z",
        "updated_at": "2023-03-01T17:54:27Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/13198484539021/comments/13581344907021.json",
        "post_id": 13198484539021,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360077326492,
    "expected_comment_count": 4,
    "actual_comment_count": 4,
    "status": "ok",
    "comments": [
      {
        "id": 360014822731,
        "body": "<p>this would be amazing if it gets added :D</p>\n<p>&nbsp;</p>\n<p>some servers are still in 1.8 because they didn't like the new combat changes<br>but there is still some server stuck in 1.12 because there servers can't handle the new updates&nbsp;:(</p>",
        "author_id": 414963808472,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077326492-Multithreading-For-Minecraft/comments/360014822731",
        "created_at": "2021-04-14T15:45:24Z",
        "updated_at": "2024-02-20T23:31:33Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077326492/comments/360014822731.json",
        "post_id": 360077326492,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 24305147849869,
        "body": "<p>It's just a generally good idea I think, Mojang should add this</p>",
        "author_id": 24305057516941,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077326492-Multithreading-For-Minecraft/comments/24305147849869",
        "created_at": "2024-02-20T23:31:29Z",
        "updated_at": "2024-02-21T17:50:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077326492/comments/24305147849869.json",
        "post_id": 360077326492,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 28508230327565,
        "body": "<p>I beg of you to add this mojang</p>",
        "author_id": 28508210731661,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077326492-Multithreading-For-Minecraft/comments/28508230327565",
        "created_at": "2024-07-17T21:20:16Z",
        "updated_at": "2024-07-17T21:40:05Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077326492/comments/28508230327565.json",
        "post_id": 360077326492,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 37950533088141,
        "body": "<p>You didn't really package this idea very well and it looks like other people have suggested it, i can't support this because we don't actually need any threading for chunk handling because that is already currently accessble. what we need and have always needed was a dedicated thread to mob AI and another dedicated thread for machine operation logic for modded environments.</p>",
        "author_id": 37950516700301,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077326492-Multithreading-For-Minecraft/comments/37950533088141",
        "created_at": "2025-07-10T00:29:36Z",
        "updated_at": "2025-07-10T14:48:46Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077326492/comments/37950533088141.json",
        "post_id": 360077326492,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 30643173424781,
    "expected_comment_count": 1,
    "actual_comment_count": 1,
    "status": "ok",
    "comments": [
      {
        "id": 30650395305741,
        "body": "<p>In my opinion, the tree log formation should look like its sapling. The leaves could have more willow like shape. Also, having downward leaves as the leaves block texture would be cool.</p>",
        "author_id": 404531857052,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/30643173424781-Better-Pale-Tree-Shape/comments/30650395305741",
        "created_at": "2024-09-29T07:15:27Z",
        "updated_at": "2024-09-29T20:14:16Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/30643173424781/comments/30650395305741.json",
        "post_id": 30643173424781,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 38607047247245,
    "expected_comment_count": 2,
    "actual_comment_count": 2,
    "status": "ok",
    "comments": [
      {
        "id": 38899691647757,
        "body": "<p>I thought this is how it should work in the first place but turns out Mojang think otherwise. It a pretty cool feature that will ruin so many parts of the gameplay like traps and secret bases. It does nothing but to work like intended (you tap the button once and sneak until you tap it one more time. I see no reason to unsneak when you enter gui).</p>",
        "author_id": 15992264420109,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/38607047247245-Revert-bug-fix-MC-163218-for-parity-with-Bedrock/comments/38899691647757",
        "created_at": "2025-08-18T17:13:45Z",
        "updated_at": "2025-08-18T17:20:36Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/38607047247245/comments/38899691647757.json",
        "post_id": 38607047247245,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 41216815542285,
        "body": "<p>Don't worry they will \"fix\" it to parity with Bedrock</p>",
        "author_id": 29372366885389,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/38607047247245-Revert-bug-fix-MC-163218-for-parity-with-Bedrock/comments/41216815542285",
        "created_at": "2025-11-17T22:54:58Z",
        "updated_at": "2025-11-17T22:54:58Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/38607047247245/comments/41216815542285.json",
        "post_id": 38607047247245,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360077305631,
    "expected_comment_count": 9,
    "actual_comment_count": 9,
    "status": "ok",
    "comments": [
      {
        "id": 360014624732,
        "body": "<p>Por mi</p>",
        "author_id": 412566785551,
        "vote_sum": 3,
        "vote_count": 3,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/360014624732",
        "created_at": "2021-03-09T21:59:45Z",
        "updated_at": "2022-11-20T21:01:38Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/360014624732.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014566311,
        "body": "<p>Quiero jugar minecraft java</p>",
        "author_id": 412566785551,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/360014566311",
        "created_at": "2021-03-09T22:00:17Z",
        "updated_at": "2022-05-03T17:58:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/360014566311.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014961072,
        "body": "<p>Porfavor quoero jugar minecrast en online                                                                                                             </p>",
        "author_id": 415343078812,
        "vote_sum": 4,
        "vote_count": 4,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/360014961072",
        "created_at": "2021-04-23T22:37:39Z",
        "updated_at": "2022-08-10T09:37:15Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/360014961072.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4404942142989,
        "body": "<p>Todos queremos jugar minecraft java en android ios y iPhone</p>",
        "author_id": 418644858471,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/4404942142989",
        "created_at": "2021-07-13T16:45:51Z",
        "updated_at": "2022-03-17T01:49:14Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/4404942142989.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4410447298957,
        "body": "<p>No me deja jugar en un servidor \n</p>",
        "author_id": 418652718531,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/4410447298957",
        "created_at": "2021-10-01T18:20:00Z",
        "updated_at": "2022-03-17T01:49:12Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/4410447298957.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 4412359118861,
        "body": "<p>No puedo jugar Minecraft bedrok no se cómo ASER para poder jugarlo lo tengo pero me dice que es el beta</p>",
        "author_id": 421512906911,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/4412359118861",
        "created_at": "2021-10-30T09:02:23Z",
        "updated_at": "2021-10-30T09:02:23Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/4412359118861.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 5973969359757,
        "body": "<p>Hola 👋</p>",
        "author_id": 5973703296397,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/5973969359757",
        "created_at": "2022-05-03T17:31:57Z",
        "updated_at": "2022-05-03T17:32:25Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/5973969359757.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 8524783119885,
        "body": "<p>Quiero tener Minecraft enmi mobil</p>",
        "author_id": 8524661672845,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/8524783119885",
        "created_at": "2022-08-18T20:14:11Z",
        "updated_at": "2022-08-18T20:14:11Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/8524783119885.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 8524775132045,
        "body": "<p>Queremos tener Minecraft java en el bedrok</p>",
        "author_id": 8524661672845,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360077305631-Quiero-juagar-minecraft-java-editio-dn-mi-telegono/comments/8524775132045",
        "created_at": "2022-08-18T20:15:06Z",
        "updated_at": "2022-08-18T20:15:06Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360077305631/comments/8524775132045.json",
        "post_id": 360077305631,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 360074472732,
    "expected_comment_count": 3,
    "actual_comment_count": 3,
    "status": "ok",
    "comments": [
      {
        "id": 360013580951,
        "body": "<p>I think this idea makes sense.</p>",
        "author_id": 396231878211,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472732-Craft-a-spyglass-with-a-piece-of-colored-glass-to-get-a-tinted-spyglass/comments/360013580951",
        "created_at": "2020-11-29T18:23:12Z",
        "updated_at": "2021-04-28T01:09:59Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472732/comments/360013580951.json",
        "post_id": 360074472732,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360013737451,
        "body": "<p>It would be cool if for bedrock because there is no spectator mode and maybe we could add monster loot to see what they see (like the spider eye)</p>",
        "author_id": 404860890551,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472732-Craft-a-spyglass-with-a-piece-of-colored-glass-to-get-a-tinted-spyglass/comments/360013737451",
        "created_at": "2020-12-10T21:47:39Z",
        "updated_at": "2021-04-28T01:10:01Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472732/comments/360013737451.json",
        "post_id": 360074472732,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 360014480832,
        "body": "<p>Funny idea, but it has no use... Maybe add a use to it? I don't really like the idea of just adding it because you would maybe use it twice and then consider it is useless because you want to see the actual colors of a block</p>",
        "author_id": 385082068792,
        "vote_sum": 1,
        "vote_count": 1,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/360074472732-Craft-a-spyglass-with-a-piece-of-colored-glass-to-get-a-tinted-spyglass/comments/360014480832",
        "created_at": "2021-02-24T13:06:09Z",
        "updated_at": "2021-05-02T02:25:49Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/360074472732/comments/360014480832.json",
        "post_id": 360074472732,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  },
  {
    "post_id": 29304642562829,
    "expected_comment_count": 2,
    "actual_comment_count": 2,
    "status": "ok",
    "comments": [
      {
        "id": 29378841824909,
        "body": "<p>Oh this'd be cool! personally I think they also need to make it so you launch further cause right now it doesn't fit with how things usually act when launched, plus let us stack minecarts again, but yah trains + having really fast carts would be fun!</p>",
        "author_id": 420508500731,
        "vote_sum": 2,
        "vote_count": 2,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/29304642562829-Experimental-Minecart-Suggestions/comments/29378841824909",
        "created_at": "2024-08-18T23:45:47Z",
        "updated_at": "2024-08-20T16:53:42Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/29304642562829/comments/29378841824909.json",
        "post_id": 29304642562829,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      },
      {
        "id": 33192939410957,
        "body": "<p>Honestly I can't believe that linking minecarts together STILL ISN'T a thing in Minecraft. It's such a basic, simple concept, it should've been added a long time ago.</p>\n<p>It is annoying as F to make use of chest minecarts because they need so much more powered rails.</p>\n<p>I feel that when they added chains to the game, they completely missed a great opportunity to use this new item (chains) as the link between carts.</p>\n<p>The faster travel would be lower on my priority list (e.g. with powered rails and/or the use of furnace minecarts) but I definitely do see a huge benifit in that as well.</p>",
        "author_id": 33192720712845,
        "vote_sum": 0,
        "vote_count": 0,
        "official": false,
        "html_url": "https://feedback.minecraft.net/hc/en-us/community/posts/29304642562829-Experimental-Minecart-Suggestions/comments/33192939410957",
        "created_at": "2025-01-03T20:38:48Z",
        "updated_at": "2025-01-03T20:40:44Z",
        "url": "https://minecraftfeedback.zendesk.com/api/v2/help_center/community/posts/29304642562829/comments/33192939410957.json",
        "post_id": 29304642562829,
        "non_author_editor_id": null,
        "non_author_updated_at": null
      }
    ]
  }
]